[
{"product_name": "Bilgi Güvenliği ve Hacking", "author": "Enes Aslanbakan", "publisher": "Pusula Yayıncılık", "content": "<p><br>Siber saldırılara karşı hazırlıklı olun! <br>Düşmanınızı tanıyın! <br>Hacking yöntemlerini öğrenerek sisteminizi güvende tutun...<br><br>Bugün internete bağlanmayan, dünya çapındaki ağların gölgesinde yaşamayan bilgisayar neredeyse hiç yok. İnternete ve çeşitli ağlara bağlanmanın bize sunduğu nimetler tartışılmaz: Anında bilgiye erişim, işlem kolaylığı, hayatı kolaylaştıran uygulamalar... Ama bu dünyanın bir de karanlık yüzü var: Bilgi güvenliğinizi tehdit eden, bilgisayarınıza, bağlantınıza ve verilerinize saldıran kötü niyetli kişiler! Hacker olarak adlandırılan bu kişiler çok çeşitli yöntemlerle bilgisayar ağlarının içine sızıyorlar, bilgisayar ve internet servislerinin şifrelerini kırarak başkalarının bilgilerini ele geçiriyorlar. Enes Aslanbakan, bu kitapta hacker'ların nasıl çalıştığını, bilgi güvenliğini hangi yöntemlerle tehdit ettiklerini ele alıyor ve temel hacking yöntemleri hakkında okuru bilgilendiriyor. Çünkü yöntemlerden haberdar olmak, hacker tehdidine karşı alınacak ilk ve en kritik önlem. <br><br>Bilgi Güvenliği ve Uygulamalı Hacking Yöntemleri, hacking yöntemlerini  uygulamalı olarak, çeşitli yazılımlarla anlatıyor ve hacker'ların hangi yollardan sisteminize sızabileceklerini somut olarak gösteriyor. Siber saldırılara karşı hazırlıklı olmak için benzersiz bir başvuru kaynağı...<br><br>\"Sızma testi çalışmalarına meraklı olan herkese bir yol haritası sunan bu kitap, özellikle uygulayarak öğrenmek isteyenler için adım adım ilerleme sağlayan iyi bir kaynak. Hemen her konuya ve pratikte kullanılan istismar araçlarına değinmesiyle geniş bir yelpazede öğretici olduğu gibi, adım adım siber saldırıların nasıl kolay gerçekleşebildiğini de göz önüne sererek tehdit boyutuna bir kere daha dikkat çekmemizi  sağlıyor. Sızma testleri ve zafiyet istismarı alanında kendini geliştirmek isteyenlerin veya yönettiği sistemlerin güvenliğini sağlamak için saldırganları daha yakından tanımak isteyenlerin 'Nereden başlamalıyım?' sorusuna cevap veriyor.\"<br><br>Burak ÇİFTER (Siber Güvenlik Uzmanı)<br>-Hacker'lar ve Exploit Türleri<br>-Penetrasyon Testi Nedir<br>-Vulnerability Analysis       <br>-Password Attacks<br>-Wireless Attacks <br>-Bilgi Toplama Yöntemleri        <br>-Ağ (Network) Haritalama       <br>-Yerel Ağ Saldırıları                         <br>- DNS Spoofing<br>-Parola Kırma Saldırıları<br>-FTP Servisine Yönelik Parola Saldırısı<br>-Mail Hesaplarına Yönelik Parola Saldırısı<br>-Anonim Olarak Gezinme<br>-Web Zafiyet Analizi ve Hacking Yöntemleri<br>-DDoS Saldırısı<br>-Firewall Tespiti<br>-Nessus ile Sızma Testi<br>-Exploit Edilen Cihazdan Alınabilecek Veriler ve İşlemler<br>-WPA / WPA2 Şifreli Ağlara Saldırı<br>-Gizli Kablosuz Ağların Tespiti<br>-Adli Bilişim<br>(Tanıtım Bülteninden)<br><br><br><br><b>Sayfa Sayısı: </b>148<br><br><b>Baskı Yılı: </b>2016<br><br><br><b>Dili: </b>Türkçe<br><b>Yayınevi: </b>Pusula Yayıncılık</p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n                <p>Henüz yorum yapılmadı!</p>\n            </div>", "detail": null}]},
{"product_name": "YouTube'da Zirveye Çıkma Rehberi", "author": "Abdullah Talha Karaalioğlu", "publisher": "Pusula Yayıncılık", "content": "<p><br>YouTube sizin için hâlâ eğlencelik bir araç olabilir. Ama on binlerce insan, YouTube'un sunduğu imkânları kullanarak çok değişik kampanyalar gerçekleştiriyor ve alışıldık pazarlama teknikleriyle mümkün olamayacak gelirler elde edebiliyor! Televizyon kanallarına ya da gazete ve dergi sayfalarına çıkmak hiç kolay ve ucuz bir şey değil, ama YouTube'u iyi kullanabilirseniz önünüzde kapılar sonuna kadar açılabilir ve milyonlarca insana ulaşabilirsiniz...<br><br>Abdullah Talha Karaalioğlu'nin kaleme aldığı Youtube'da Zirveye Çıkma Rehberi, sosyal medya ve dijital pazarlama alanında Türkiye'de uzun zamandır beklenen kaynak eksikliğini ortadan kaldırıyor. Başlangıç seviyesinden uzmanlık seviyesine kadar A'dan Z'ye tüm konuların işlendiği kitapta sadece Youtube platformuna bağlı kalınmamış, dolayısıyla okuyucunun aynı yöntemleri farklı dijital yayın platformlarında da uygulayabilmesi mümkün. Ayrıca kolay para kazanma yöntemleri, farklı reklam ağları ile çalışma teknikleri, dijital pazarlama stratejileri, sosyal medyayı amaca uygun kullanma taktikleri ve sır gibi saklanan çok özel dijital manipülasyon tekniklerine yer verilmiştir. Sık kullanılan ve sadece uzmanlar tarafından bilinen tekniklere yer verilen kitap, dünya çapında Youtube ve dijital manipülasyon teknikleri hakkında geniş bir içeriğe yer veren ve nasıl yapıldığını anlatan ilk eser olma özelliğini taşıyor. Üstelik herkes bu kitabı rahatça anlayıp, ele alınan teknikleri uygulayabilir: Tüm teknikler ilk defa bilgisayar kullanan bir insanın bile kolayca yapabileceği şekilde izah edilmiş...Bu eser, hızla gelişen ve sınırı olmayan dijital dünyada tüm hayallerinizi gerçekleştirebilecek imkânları sunuyor.<br><br>-Başarılı Bir Kanal Oluşturmak ve Büyütmek -Abone ve Hayran Kazanmak -Yüksek Görüntülenme Sayısı için Püf Noktalar -YouTube ve Adsense  -YouTube Ortaklık Ağları -Oyun Kanalı Açmak -Let's Playciler için Altın Rehber -Oyun Kanalınızı Büyütmek -Video Hazırlama Teknikleri -Videolarınız için Ücretsiz Stok Video ve Müzikler -Özgün Videolar için İpuçları -Youtube ve SEO -Backlink Nedir, Ne işe Yarar? -Gizli Silahlar -Yeni Nesil Backlink Yöntemleri ve Kaynakları -YouTube Reklam Modelleri -Kazanç Elde Etme Yöntemleri -Niş Çalışmaları -Yüksek Kazançlı Nişler -Sosyal Medya ve Dijital Pazarlama -Twitter, Pinterest, Linkedin, Instagram ile Pazarlama -Dönüşüm Oranını Arttırma -Video ile Pazarlama Stratejileri -Hızlı Abone Kazanma -YouTube'dan Dünyaya Canlı Yayın -Vlogger -Ücretsiz VPS<br><br>Abdullah Talha Karaalioğlu, 1986'da İstanbul'da dünyaya geldi. Yurt dışında yüksek lisans eğitimini tamamladıktan sonra gerçekleştirmek istediği projeler için Türkiye'ye döndü. Bir çok markanın proje yönetimini, business development ve dijital strateji danışmanlığını üstlendi. Avrupa'dan Türkiye'ye uyarlanan bir çok projede görev aldı.<br>(Tanıtım Bülteninden)<br><br><br><br><b>Sayfa Sayısı: </b>444<br><br><b>Baskı Yılı: </b>2016<br><br><br><b>Dili: </b>Türkçe<br><b>Yayınevi: </b>Pusula Yayıncılık</p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n               <strong>\n                   beklediğimden de iyi \n               </strong>\n               <p>Kitap elime bugün ulaştı ve paketi açınca şaşırdım enine boyuna büyük bir kitap içindekiler kısmını okuyunca buradaki yazan bilgilerden daha fazla bilgiye sahip kitap mutlaka almanızı öneriyorum başka kitaba gerek yok</p>\n           </div>", "detail": "<div class=\"comment-details\">\n               <p>20.12.2016</p>\n           </div>"}]},
{"product_name": "Her Yönüyle C# 6.0", "author": "Sefer Algan", "publisher": "Pusula Yayıncılık", "content": "<p></p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n               <strong>\n                   Kitap\n               </strong>\n               <p>başlangıç için bir göz attım anlatımı gayet iyi görünüyor alınabilecek en iyi kitap fiyatı 70 tlden 50 tl ye düşmüştü  bir tek burda buldum alın bence.</p>\n           </div>", "detail": "<div class=\"comment-details\">\n               <p>20.04.2015</p>\n           </div>"}, {"content": "<div class=\"comment-content\">\n               <strong>\n                   Açıklama\n               </strong>\n               <p>Programcılıkta sınır tanımayan bir kaynaktır. Bu işe gönül vermiş bir usta!<br>Kesinlikle kitaplıklarınızda bulunması gereken bir eser?</p>\n           </div>", "detail": "<div class=\"comment-details\">\n               <p>27.05.2013</p>\n           </div>"}]},
{"product_name": "Ethical Hacking", "author": "Ömer Çıtak", "publisher": "Level", "content": "<p><br>Hacker'lar temelde Siyah Şapkalı ve Beyaz Şapkalı olmak üzere ikiye ayrılır. Siyah şapkalılar öğrendikleri teknik ve yöntemleri kendi çıkarları ve diğer insanlara zarar vermek için kullanırlar. Beyaz şapkalılar ise siyah şapkalılar ile aynı teknik ve yöntemleri öğrenip; siyah şapkalılar kimseye zarar vermesin diye sistemleri korumaya çalışırlar. Bu kitap da hacking'in temel konuları hem siyah şapka hem beyaz şapka açısından ele alınıyor. Bir tekniğin siyah şapkalı bir hacker bir sisteme zarar vermek için ne şekilde kullanıldığı (offensive) ve ardından bu güvenlik zafiyetinin beyaz şapkalı hacker tarafından nasıl korunacağı (defensive) anlatılıyor.<br><br>Kitap konu içeriği CEH, yani Certified Ethical Hacking ile paraleldir. CEH, siber güvenlik sektöründeki her firmanın en önem verdiği sertifikalardan biridir. Siber güvenlik sektöründe çalışmak isteyip, CEH sınavına hazırlananlar için kitap yardımcı mahiyette olacaktır.<br>(Tanıtım Bülteninden)<br><br><br><br><b>Sayfa Sayısı: </b>256<br><br><b>Baskı Yılı: </b>2016<br><br><br><b>Dili: </b>Türkçe<br><b>Yayınevi: </b>Level</p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n               <strong>\n                   Mükemmel \n               </strong>\n               <p>Kesinlikle öneriyorum mükemmel bir kitap :)</p>\n           </div>", "detail": "<div class=\"comment-details\">\n               <p>07.11.2016</p>\n           </div>"}, {"content": "<div class=\"comment-content\">\n               <strong>\n                   Harika\n               </strong>\n               <p>Sıfırdan başlayıp bir şeyler öğrenmek isteyenler için gayet başarılı bir kitap olmuş ancak almadan önce PHP, SQL, JAVA ve C gibi diller ve konular hakkında biraz bilginiz olmasını düşünerek alın. Bunu alayım Black Hacker olayım diye dalmayın konuya. Bugün geldi 65 sayfa okudum. Hiç bir şey mi olmadı, kültür seviyesini arttırır.</p>\n           </div>", "detail": "<div class=\"comment-details\">\n               <p>11.08.2016</p>\n           </div>"}]},
{"product_name": "OpenCv", "author": "Birol Kuyumcu", "publisher": "Level", "content": "<p><br>Yazılım sektörünün gelişkinliği şüphesiz ki yapay zekâ alanındaki ilerlemelerle ölçülüyor. Akıllı cihazlar tamamen otomatik ya da daha az insan denetimi gerektiren makineler içeriklerinde yapay zekâ algoritmaları da barındıran yazılımlardır. Türkiye şartlarında çalışma alanınız değişmese bile daha zeki web sayfaları, daha akıllı veritabanları ya da mobil uygulamalar sizlerin çalışmalarınızı daha kıymetli yapacağı aşikârdır.<br><br>Yapay Zekâ uygulamalarının en büyük alanlarından biri de -Bilgisayarlı Görü- Computer Vision'dur. Temelde Görüntü İşleme metotları, ilaveten Yapay Öğrenme - Machine Learning algoritmaları içeren bir alandır. Bu alanda ülkemizde akademik olarak pek çok çalışma yapıldığı halde maalesef ticari çalışmaya pek rastlanamamaktadır. Biz de bu kitapla, bilgisayarlı görü alanında dünyaca en yaygın olarak kullanılan kütüphane olan OpenCv'yi sizlere tanıtmak; vereceğimiz örneklerle çalışmalar yaparak ufkunuzu bir nebze olsun açmayı umuyoruz.<br><br>C++ dili ile birlikte yer yer Qt Framework kullanarak, OpenCv'yi anlatan bu kitapta, aşağıda konu başlıklarına yer verilmiştir.<br>(Tanıtım Bülteninden)<br><br><br><br><b>Sayfa Sayısı: </b>320<br><br><b>Baskı Yılı: </b>2016<br><br><br><b>Dili: </b>Türkçe<br><b>Yayınevi: </b>Level</p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n                <p>Henüz yorum yapılmadı!</p>\n            </div>", "detail": null}]},
{"product_name": "Java Programlama Dili ve Yazılım Tasarımı", "author": "Altuğ B. Altıntaş", "publisher": "Papatya Bilim", "content": "<p><br>Bu kitapta, Java programlama dili başlangıçtan ileri düzeye kadar her açıdan ele alınmıştır. Böylesi bir eser bir yazılım tasarımcısının veya bir programcının her zaman elinin altında bulunması gereken klasik bir eser niteliğindedir. Çünkü Java programlama diliyle ilgili, yeni başlayan ve profesyoneller için neredeyse herşey bu kitapta vardır. Yazarının Java konusunda engin deneyimi ve editörünün bilgisayar mühendisliği konusundaki olgunluğu bu kitaba doğrudan yansımıştır ve böyle bir eserin bir benzerini hazırlamak nerede ise imkansız olmuştur.<br><br>Java Programlama dili nesneye yönelik, bir kere tasarla her yerde çalıştır felsefesine dayanan, belleği verimli kullanmak için çöp toplama sistemi olan, güvenli, İnternet ve Web uygulamaları için elverişli (Applet, JSP, Servlet, Corba, RMI, EJB, Apache Wicket) bir tasarım aracıdır.<br><br>(...) Java programlama dili, Sayın Altuntaş'ında belirttiği gibi \"uygulamaların farklı işletim sistemleri üzerinde çalıştırılabilmesi düşüncesiyle geliştirilmiş bir teknolojidir. Java teknolojisi kullanılarak aynı uygulama farklı ortamlarda çalıştırılabilir. Örneğin kişisel bilgisayarlarda, tablet bilgisayarlarda, üstelik cep telefonlarında... Java™ platformu hem programlama dili, hem de bir ortam olarak düşünülebilir. Programlama dili olarak, açık kodlu, nesneye yönelik, güvenli, sağlam, İnternet için elverişli bir teknolojidir denilebilir. Kısaca göz atılırsa Java ile, GUI (Grafiksel Kullanıcı Arayüzü) uygulamaları, Applet'ler, veritabanına erişimle ilgili uygulamalar, Servlet, Jsp (Web tabanlı uygulamalar), dağınık bileşenler, cep telefonları, Smart kartlar için uygulamalar, Apache Wicket ile Web uygulamaları vs gibi birçok alanda -uygulama geliştirilebilir.\" <br>-Dr. Rıfat Çölkesen-<br>(Tanıtım Bülteninden)<br><br><br><br><b>Sayfa Sayısı: </b>720<br><br><b>Baskı Yılı: </b>2016<br><br><br><b>Dili: </b>Türkçe<br><b>Yayınevi: </b>Papatya Yayıncılık</p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n                <p>Henüz yorum yapılmadı!</p>\n            </div>", "detail": null}]},
{"product_name": "Bootstrap 4", "author": "Uğur Gelişken", "publisher": "Level", "content": "<p><br>\"İlk Önce Mobil\" sloganı ile üretilmiş olan JavaScript ve CSS birleşimi olan melez bir Framework olan Bootstrap, günümüzde neredeyse yeni nesil bütün web sayfalarının tasarımlarında ve hybrid olarak üretilen mobil uygulamaların arayüz tasarımında, geliştiricilerinin de iş yükünü hafifletmektedir.<br><br>Kitap, Bootstap v4 sürümünü bütün yönleriyle uygulamalı olarak ele almıştır. Genel olarak tipografi, grid sistemi, bileşenler, bileşenlerin jQuery ile kullanımı, CSS ile ortak kullanımları ve daha birçok özellik uygulamalı olarak işlenmiştir. Ayrıca, yeni nesil Frond-end Toolkit'ler dediğimiz Node.js tabanlı çalışan npm paket yöneticisi ve Grunt görev yöneticisi de uygulamalı olarak ele alınmış, şu an sektörde en çok ihtiyaç duyacağınız uygulama örnekleri (proje oluşturma, sürüm notları, dosya değişikliği izleme, real-time yansıtma, yedekleme, SASS derleme, HTML, JS ve CSS dosyalarını minimize etme, dosya birleştirme gibi) de video destekli olarak anlatılmıştır. Kitapta edineceğiniz bilgilerle, responsive (duyarlı) web arayüzü geliştirme kendinizi geliştirmiş olacaksınız.<br><br>Kitapla ile birlikte ücretsiz olarak verilen CD içerisinde, kitapta anlatılan örneklerin kaynak kodları, front-end toolkit'lerin kullanımı ile ilgili uygulama örneklerine ait eğitim videolarını ve gerekli diğer araçları bulabilirsiniz.<br><br>Genel olarak kitaptaki ana başlıklar şunlardır:<br><br>-A'dan Z'ye Bootstrap 4<br>-Bootstap'a Giriş ve Temel Kavramlar<br>-Responsive ve Adaptive Kavramları<br>-Sublime Text ile Kodlama <br>-Responsive Tasarım Test Araçları <br>-Bootstrap 4 ile Gelen Yenilikler ve Geride Bırakılanlar<br>-Grid (Izgara) ve Media Object (Medya Nesnesi) Düzen Sistemi<br>-Bootstrap CSS (Tipografik Stiller)<br>-Bootstrap Components (Bileşenler) ve jQuery Plug-in'leri<br>-jQuery ile Bootstrap Bileşenlerini Kontrol Etme<br>-PHP ile Bootstrap Navbar Kullanımı<br>-Yazdırma İşleminde Gösterilecek Alanları Belirleme ve Yazdırma için Sade Stil Verme<br>-@media Sorgularına Göre Stil Değiştirme ve DOM Gizleme/Gösterme<br>-FrontEnd Toolkit'leri ile Otomasyon ve Optimizasyon Sağlama<br>-npm ile Boostrap Projesi Oluşturma<br>-Versiyonlama Mantığı ve Avantajları<br>-Grunt ile Görevleri Otomatikleştirme<br>-Paket Yapılandırması<br>-Grunt Task Tanımlama Teknikleri<br>-Uygulamalı Olarak Aşama Aşama Dosya İzleme, Real-time Yansıtma, Yedekleme, SASS'ı CSS'e Derleme, CSS/JS Birleştirme, CSS/JS/HTML Minimize Etme Grunt Task'larını Kullanma<br>(Tanıtım Bülteninden)<br><br><br><br><b>Sayfa Sayısı: </b>240<br><br><b>Baskı Yılı: </b>2016<br><br><br><b>Dili: </b>Türkçe<br><b>Yayınevi: </b>Level</p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n               <strong>\n                   Her Webmaster'ın edinmesi gereken bir kitap\n               </strong>\n               <p>Duyarlı arayüz tasarımı ve front-end araçlarının etkili bir şekilde kullanıldığı, anlatımı gayet anlaşılır ve güncel içeriklerle hazırlanmış bir kitap. Zaten yazarı Uğur Gelişken olunca bundan daha azı da beklenmezdi.</p>\n           </div>", "detail": "<div class=\"comment-details\">\n               <p>28.04.2016</p>\n           </div>"}, {"content": "<div class=\"comment-content\">\n               <strong>\n                   Uğur Bey'e teşekkürler.\n               </strong>\n               <p>Bilişim dünyasında kodlama alanında çok başarılı bir yazar Uğur Bey ve kitapları her zaman takibimde.</p>\n           </div>", "detail": "<div class=\"comment-details\">\n               <p>23.04.2016</p>\n           </div>"}]},
{"product_name": "Python 3", "author": "Timur Karaçay", "publisher": "Seçkin Yayıncılık", "content": "<p><br>Python'a giriş niteliğinde olan bu kitap, hiç programlama bilmeyenlere programlamanın temellerini ve Python'u öğretmek amacıyla yazılmıştır. Sisteminize Python'u nasıl yükleyeceğinizden başlayarak, Python araçlarını tanıtan kitap, 100'den fazla örnek uygulama ve 150'den fazla program ile konuları akıcı bir üslup ve pedagojik yöntemlerle anlatmaktadır.<br><br>Python etkileşimli, yorumlayıcı ve nesne tabanlı bir dildir. Javascript, VBasic, PHP, ASP, JSP gibi script dillerinin bütün hünerlerine fazlasıyla sahiptir. Onu web uygulamalarınızda bir script dili olarak kullanabilirsiniz. Python nesne tabanlı bir dildir. Python'da her şey nesnedir. Nesne tabanlı programlamanın bütün hünerlerini onda görebilirsiniz.<br><br>Otuzdan çok kitaba imza atmış olma yanında TDK ve TÜBA'nın bilimsel terim üretme çalışmalarına etkin olarak katılan yazar, bu kitapta da Türkçe bilim terimlerini kullanmaya özen göstermiştir.<br><br><b>Kitapta Bulunan Konu Başlıkları</b><br></p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n                <p>Henüz yorum yapılmadı!</p>\n            </div>", "detail": null}]},
{"product_name": "Hacking Interface", "author": "Hamza Elbahadır", "publisher": "Kodlab", "content": "<p><br>Bilişimin Yeraltı Dünyasından. Merak Etmiyor musun?<br><b>Bir Hacker'ın Gözüyle Saldırı Senaryoları Sistem Açıkları ve Korunma Yöntemleri</b><br>Okuyacağınız bu kitapta bir saldırganın hedeflediği sisteme sızma göçertme çıkar elde etme yolunda kullanacağı yöntemler ve bunlara karşı alabileceğiniz güvenlik önlemleri titiz bir şekilde belirli bir sıra ve düzen dahilinde konu olarak ele alınmıştır. Belirtmek isterim ki bu metotlar saldırgan adaylarına ışık tutmak için değil düşmanı düşmanın silahıyla vurmanızı sağlamak için yazılmıştır...<br><br>Kitabın program tanıtımları yapılarak veya sayfalarca uygulama kaynak kodları verilerek özen gösterilmiş içeriğin özgün olması için açık ve hataların oluşma sebepleri ve saldırıların çalışma prensipleri anlatılmıştır.<br><br>Her yazılımcının ağ uzmanının sistem yöneticisinin ve bilgisayar kullanıcısının büyük kayıplar vermeden önce okuması gereken bir kitap.<br><br><b>HACKING INTERFACE </b><br>İnternet'in yeraltı dünyasını merak etmiyor musunuz Bilişimin karanlık dünyasında hedef sistemlere sızmak için yapılan tüm saldırıları ve korunma yöntemlerini öğrenmek istiyorsanız bu kitap tam size göre.<br><br>Günümüz dünyasının en az reel hayatı kadar önemli olan sanal dünyası teknolojik ilerlemeyle birlikte birçok güvenlik tehdidini de beraberinde getirmiştir. Kurumsal işlevli e posta adresleri çalınıyor online alışverişte kullanılan kredi kartı bilgileri ele geçiriliyor kritik bilgilere sahip ağlar izleniyor. Sistemlere karşı yapılan saldırı metotlarının birçoğu bilinmesine rağmen neden karşı konulmaz bir şekilde saldırılar hala devam ediyor Kullanılan güvenlik duvarları saldırı tespit önleme sistemleri ve yazılımlar... Hiç biri güvenliğin sağlanması için yeterli olmuyor. O halde eksik olan nedir merak ettiniz mi?<br><br>Bu kitapta sisteminize gelebilecek saldırılar bir Güvenlik Uzmanı gözüyle değil bir Hacker'ın gözüyle incelenmiştir. Hedeflenen sisteme saldırı öncesi bilgi toplama aşamasından saldırı sonrası kayıtları silmeye kadar olası senaryoları ve ihtimalleri bir bütün olarak ele alınıp geliştirilebilecek güvenlik çözümleri sunulmuştur. Konuların anlatımında yalın bir dil tercih edilmiş ve en temel seviyeden en profesyonele kadar her kesime hitap etmesine özen gösterilmiştir.<br><br><br><br><b>Sayfa Sayısı: </b>272<br><br><b>Baskı Yılı: </b>2016<br><br><br><b>Dili: </b>Türkçe<br><b>Yayınevi: </b>Kodlab</p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n               <strong>\n                   Güzel\n               </strong>\n               <p>Kitabın anlatım dili başlangıç seviyesindeki okurlar için gayet anlaşılır ve bilgiler oldukça öz biçimde aktarılmış.</p>\n           </div>", "detail": "<div class=\"comment-details\">\n               <p>08.06.2014</p>\n           </div>"}]},
{"product_name": "Android Studio Üzerinden Anlatımlı Örneklerle Android Programlama Eğitimi - DVD'li", "author": "Aykut Taşdelen", "publisher": "Pusula Yayıncılık", "content": "<p><br>Başlangıçtan ileri seviyeye kadar tüm Android programcıları için hazırlanan bu akademik kaynak, Android Studio üzerinden anlatımlı örneklerle ve uygulamalar içeren DVD ile birlikte geliştiricilere Android'in kapılarını açıyor. <br><br>Bu kitap 2011 yılından beridir, üniversitede Android üzerine açılmış ilk lisans derslerini okutan deneyimli  eğitimci Aykut TAşdelen tarafından kaleme alındı. Bu nedenle kitap, konuları pedagojik bir sistematiğe göre ayrıştırıp, akademik bir ciddiyet içerisinde ele alıyor. Konunun arka planını anlatmayı hedefleyen Taşdelen, ekran görüntüleri ile doldurulmuş yüzeysel içerikli bir kitap yerine, bazı noktalarda Android kütüphanesinin kendi kaynak kodlarından alıntılar yaparak -sadece bir şeyin nasıl yapıldığını değil aynı zamanda o görevi yerine getiren sınıfların nasıl yazıldıklarını anlatıyor- ayrıca UML ile modellemeler yaparak, kütüphanenin tasarım detaylarını da inceliyor. Teori ve pratiğin ayrılmaz bir bütün olduğu gerçeğinden yola çıkılarak, kitap Android üzerine uygulama geliştirme isteyen kişiler için bolca örnek kod içeriyor ve kaliteli kodlama için çeşitli teknikler öğretiyor. <br><br>Java, C# veya C++ dillerinden herhangi birisinde belirli bir seviyeye gelmiş programcılara, Android programlamayı başlangıcından ileri seviyeye kadar öğretmeyi hedefleyen kitap, Android dünyasındaki son yeniliklere göre hazırlandı. Örneğin anlatımlar Eclipse yerine Google'ın resmi IDE olarak kabul ettiği Android Studio üzerinden yapılıyor. Ayrıca Lollipop gibi yeni versiyonlarla gündeme gelmiş olan ART gibi yeni olgular anlatılıyor ve API versiyonlarındaki son güncellemeler ele alınıyor. Kitap C# ve C++ programcıları için Java'nın bu iki dilden farklılıklarını (sıfırdan Java anlatmadan) ek bir bölümde  özetliyor.<br><br>Kitapla birlikte, her bölümde anlatılan kod satırları ile ilgili daha fazla örnek içeren DVD kullanıcılara sunuluyor. DVD'de her bölüme göre ayrı ayrı düzenlendi. Kitapta anlatılan konularla ilgili daha fazla örnek ve kod, Android Studio formatında yer alıyor. <br><br><br><br>Kitapta Yer Verilen Başlıca Konular: <br>   <br>Dalvik, ART, Sandbox, Zygote, Forking, AOT, vb<br>Fragment, Layout ve View Sınıfları<br>YAFSS2 Dosya Sistemi Ve Dosya İşlemleri<br>Shared Preferences, Process'ler<br>MVC Paterni ve Çok Katmanlı Mimari <br>SqLite Veritabanı İşlemleri<br>BLOB verilerle çalışma<br>ContentProvider, Servisler, MultiThreading, Asenkron Çalışma<br>JSON, SOAP ve RESTful Web Servisler <br>Çizim İşlemleri, SurfaceView, Animasyonlar<br>Kamera, Ses Tanıma, Seslendirme  <br>GPS, Sensörler, Broadcasting<br>GoogleMap, Places API'leri <br>SMS, Mail, Arama<br>Bluetooth ve Arduino <br>Java'nın C++ ve C#'tan Farklılıkları  <br>NFC Haberleşmesi<br>Gesture Kullanımı, Validasyon<br>Xamarine ve C# ile Uygulama Geliştirme<br>SwipeDown Gesture<br>Jsoup<br>ConstraintLayout<br>(Tanıtım Bülteninden)<br><br><br><br><b>Sayfa Sayısı: </b>566<br><br><b>Baskı Yılı: </b>2016<br><br><br><b>Dili: </b>Türkçe<br><b>Yayınevi: </b>Pusula Yayıncılık</p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n               <strong>\n                   En iyi kaynak\n               </strong>\n               <p>Eğer biraz programlama bilginiz varsa android studio'yu ve java dilini biraz biliyorsanız, o zaman gelişmeniz için en iyi kaynak. İlk önce konu isminin anlamını açıklayan sonrada örnek kodlarla destekleyen çok güzel bir kitap.</p>\n           </div>", "detail": "<div class=\"comment-details\">\n               <p>07.07.2016</p>\n           </div>"}]},
{"product_name": "Linux Komut Satırı", "author": "Kemal Demirez", "publisher": "Abaküs Kitap", "content": "<p><br><b>Linux'cunun Alet Çantası!</b><br>Linux işletim sistemini öğrenmek isteyenler ya da bu sistem hakkında bilgisi olup da tecrübesini artırmak isteyen kişilerin en önemli sıkıntısı derli toplu bir kaynak bulabilmektir. Elbette internet üzerinde ya da basılı olarak birçok kaynak bulabilirler fakat güncel ve sade bir anlatımı olan bir başvuru kaynağı her zaman bulunamayabiliyor.<br><br>Bu kitap bu alandaki açığı kapatmak ve kullanıcıların ihtiyacını karşılamak adına hazırlandı. Kitapta olabildiğince sade ve net bir anlatımı tercih edildi. Daha çok Linux komut satırı, dolayısıyla Linux komutlarının kullanımını örneklendirmeye ve en işe yarar komutlar anlatılmaya çalışıldı. Linux işletim sistemini etkin kullanmak ve ayrıca siber güvenlik alanında ilerlemek isteyen kişilerin de Linux bilgisini pekiştirmek için bu eserin yardımcı olacağı inancındayız.<br><br>Kitapta Kali Linux dağıtımının kullanılması beni ilk cezbeden nokta oldu. Konu zenginliği ve sade-anlaşılır bir anlatım olmuş. \"Herkes için\" ifadesi bu kitap için tam yerinde olacaktır. <br>-İsmail Saygılı, Bilgi Güvenliği Uzmanı-<br><br>\"Ülkemizdeki en büyük Türkçe kaynak eksikliklerinden biri tartışmasız Türkçe Linux kaynağıdır. Linux, birçok altyapı ve bütünleşik mimarinin bel kemiğini oluşturmasına rağmen kaynakların bu denli az oluşu, bu sistemleri doğru bir şekilde yönetemiyor olmamızın temel nedenini oluşturmaktadır. Kemal Hoca, bu eksikliği fark etmiş ve pratik yönelimli güzel bir kaynak hazırlamış. Gerek siber güvenlik gerekse de sistem uzmanlığı alanlarında çalışmak isteyen veya kendini bu alanlarda geliştirmek isteyen arkadaşlar için sürekli çantalarında bulunması gereken bir kaynak...\" <br>-Eyüp Çelik, Siber Güvenlik Birim Yöneticisi&amp;Siber Güvenlik Danışmanı, Cyber Security Delivery Manager&amp;Cyber Security Consultant-<br><br>Bash ve Linux Komut Satırı<br>Düzenli İfadeler<br> (Regular Expressions)<br>Sed ve Awk<br>Vim Editör<br>Network Komutları<br>SSH Servisi<br>WGET ile Dosya İndirme<br>Zamanlanmış Görevler<br>LOG Dosyaları<br>Dosya İşlemleri<br>Disk İşlemleri<br><br><br><br><b>Sayfa Sayısı: </b>256<br><br><b>Baskı Yılı: </b>2016<br><br><br><b>Dili: </b>Türkçe<br><b>Yayınevi: </b>Abaküs Kitap</p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n                <p>Henüz yorum yapılmadı!</p>\n            </div>", "detail": null}]},
{"product_name": "Web Tasarımı ve Web Programlama - A'dan Z'ye Yeni Nesil Tekniklerle", "author": "Uğur Gelişken", "publisher": "Level", "content": "<p><br>Zamanınızı ve Emeğinizi; Modası Geçmiş Bilgilerle Boşa Harcamayın. Yeni Nesil Tekniklerle Web Tasarımı ve Web Programlama Öğrenin!<br><br>Kitap, genel amacı ile size web tasarımı ve web programlama konusunda bilmeniz gereken hemen hemen her şeyi sizlere pratik örneklerle, sektörde kullanılan tekniklere dayalı olarak uygulamalı bir şekilde anlatmaktadır. <br><br>Günümüz, internet çağı, artık her bir bilgiye istediğimiz zaman anında ulaşabiliyoruz. Evet, istediğimiz her bilgiye anında ulaşıyoruz; ama bu bilgilerin ne kadarı işe yarar bilgi, ne kadarı güncel, ne kadarı da anlaşılabilir halde... Eğer yeni başlayan biriyseniz; bir konuyu öğrenmek için araştırma yaptığınızda onlarca sayfa içinde, aradığınız bilgilere ulaşmak isterken kaybolmanız ihtimal dâhilindedir. Yine neyi öğreneceğinizi bilmeniz de size çok fazla vakit kaybettirecektir. Çünkü öğrenmeye yeni başlayan insanlar, bir anda her şeyi öğrenmeye çalışıp çoğunlukla da bilgi yoğunluğuna maruz kaldığı için, o anlık öğrendiği bilgiler zihinlerinde kalıcı olmaz. Yine öğrenmiş olduklarının da çoğunun aslında sektörde daha kullanılmadığını fark ettiklerinde, kaybetmiş oldukları zaman ve emek için üzüntü duyacaklardır. Bu nedenle size doğru öğrenme metotları ile doğru teknolojileri uygulamalarla öğrenmenizde yardımcı olacağım. Yine kitap boyunca sizi gereksiz metinler ve sırf kitabı doldurmak için yazılmış olan çöp yazılarla sıkmayacağım. Direkt konuya gireceğiz ve ilk sayfalardan itibaren somut olarak işe yarar bir şeyler öğrenmeye başlayacaksınız. Yeri geldikçe de dipnotlarla ekstra bilgiler verip konuyu daha iyi kavramanızı sağlayacağım.<br><br>Özet olarak kitabın akışı şu şekilde olacaktır:<br>Kitaba başlarken ilk olarak yeni tasarım ve programlama trendlerini göz önünde bulundurarak, HTML5 dilini Semantik Web temelleri ile öğreneceksiniz. Sonrasında ise CSS3, SASS ve SCSS ile yeni nesil metotlar kullanarak içerikleri biçimlendirmeyi göreceksiniz. Ardından JavaScript (EcmaScript 5) dilini genel anlamı ile kullanmayı, OOP yaklaşımı ile de kodlamayı öğreneceksiniz. Buraya kadar web önyüz programlamanın 3 temel bacağını rahatlıkla kontrol edebiliyor olacaksınız.<br><br>Ardından ikinci aşamaya geçilecek. Mobil ve Responsive kavramları ile Bootstrap CSS Framework'ünü kullanarak daha pratik ve daha etkili bir şekilde arayüz tasarımını öğreneceksiniz. Web sayfalarınızda biraz dinamiklik katmak için de VelocityJS ve AniJS Framework'lerini de öğrenip, web bileşenlerinize canlılık katacaksınız.<br><br>Web arayüz programlamada MVVM mimarisini ele alacağız. Günümüzde en çok kullanılan JavaScript Framework'ü olan AngularJS ile MVVM modelini kullanarak daha güçlü web sayfaları programlamayı bolca örneklerle öğreneceksiniz. <br><br>Üçüncü aşamada ise sunucu programlama ve veritabanı yönetimine geçeceğiz. Sunucu programlama dili olarak PHP'yi genel olarak öğreneceksiniz. PHP'de OOP yaklaşımını da kavradıktan sonra MySQLi ile veritabanı yönetimini SQL sorguları ile yine bol bol pratik yaparak somut örneklerle öğreneceksiniz. <br><br>Temel olarak web tasarımı, web önyüz ve arkayüz programlamayı öğrendiğiniz bu aşamada, SEO konusunu ele alacak ve SEO yaklaşımı ile nasıl programlama yapmanız gerektiğini örneklerle göreceksiniz. <br><br>Artık bilgileriniz pekiştirmek için baştan sona Mobil Web Sitesi projesi hazırlayacağız. Bu projede HTML5, Bootstrap, AngularJS, PHP ve MySQLi kullanacağız. Hazırladığımız web sayfası için bir de CMS, yani İçerik Yönetim Sistemi kodlayacağız. <br><br>Son olarak HTML5 Canvas ile PhaserJS framework'ünü kullanarak adım adım bir platform oyunu kodlayacağız. Ek olarak ActionScript 3.0 geliştiricilerini de unutmayarak, Adobe Flash CC ile ActionScript 3.0 kullanarak HTML5 Canvas ve WebGL platformu için nasıl uygulama ve animasyon geliştireceklerini de örneklerle inceleyeceğiz.<br><br>Kitapta yer alan ana başlıklar şunlardır:<br></p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n               <strong>\n                   Dolu Dolu\n               </strong>\n               <p>Kitabın bültenini okumak bile insanı bilgilendirmeye yetiyor. Ve kitabı aldığında da bunların hepsini öğreneceğini bilmek insanı heyecanlandırıyor. İçerik gerçekten de güncel yapılar ile anlatılmış. bir Web tasarımcısının veya arkaplan kod geliştiricisinin bilmesi gereken konuların hepsi ve daha fazlası uygulamalar ile anlatılmış. Kitabın yanında verilen eğitim setleri de bonus etkisi yapıyor. Herkese tavsiye edebileceğim bir kitap.</p>\n           </div>", "detail": "<div class=\"comment-details\">\n               <p>28.04.2016</p>\n           </div>"}, {"content": "<div class=\"comment-content\">\n               <strong>\n                   Güncel ve Başarılı Bir Çalışma\n               </strong>\n               <p>Önceki kitabınızı da okumuştum, çok faydalı olmuştu bunun da çok iyi olduğuna eminim.</p>\n           </div>", "detail": "<div class=\"comment-details\">\n               <p>23.04.2016</p>\n           </div>"}]},
{"product_name": "Uygulamalarla Unity 3D ile Oyun Geliştirme", "author": "Mehmet Ünsal", "publisher": "Abaküs Kitap", "content": "<p><br>Bilgisayar için bir oyun geliştirmek herkesin hayallerini süsler ve bilgisayarla tanışan herkes ilk başta bilgisayarın bir oyun makinası olduğunu ve iş için kullanılmasının anlamsız olduğunu düşünür. Bu düşünce oynadığı oyunların zevkiyle birleşir ve bu oyunlar nasıl yapılıyor, ben de yapabilir miyim araştırmasına sokar. Günümüz internetinde birçok oyun geliştirme sitesi var ve bu sitelerde birçok kişi her gün bu yeni hevesin sorularıyla geziniyor. Kiminin hevesi kırılıyor kimi yanlış başlangıç yapıyor kimi de eksik kaynak nedeniyle bu hevesini kaybediyor. Bizim kitabımız bu hevesinizi daha da güçlendirip size birçok seçenek sunacak.<br><br>Bu kitapta, oyun geliştirmek için bilmeniz gereken her şey detaylarıyla ele alınarak, adım adım bir oyun projesi geliştirilmiştir. Kitapta oyun geliştirmeye yeni başlayanlar da düşünülerek işe en başından başlanılmış; oyun tarihi, oyun için senaryo nasıl yazılır, oyun sahne ve karakterleri senaryoda nasıl anlatılır, storyboard nasıl hazırlanır, yazdığımız tüm her şeyi nasıl üç boyutlu bir hale getirebiliriz, bu üç boyutlu objelere nasıl daha orijinal kaplama ve giydirme uygulayabiliriz, oyun için gerekli ses ve görsel efektlerin nerelerde nasıl kullanılması gerektiği ve nasıl yapıldığını, tüm aşamalarını bitirdiğimiz oyun projemizi bir oyun motoru ile nasıl oyuna dönüştüreceğimiz, tüm incelikleriyle anlatılmıştır. Üstelik sadece yazılımla değil, A'dan Z'ye tüm aşamalarıyla.<br><br>-Yaratıcı Fikir Oluşturma<br>-Oyun Görsellerinin Çizimi<br>-Senaryo<br>-Audacity Eğitimi<br>-Storyboard<br>-Ses Efektlerinin Yapımı<br>-Sahne ve Karakterlerin Oluşturulması<br>-Görsel Efektlerin Yapımı<br>-3Ds Max Eğitimi<br>-JavaScript Eğitimi<br>-3 Boyutlu Nesnelerin Tasarlanması<br>-Photoshop Eğitimi<br>-Unity 3D Eğitimi<br>(Tanıtım Bülteninden)<br><br><br><br><b>Sayfa Sayısı: </b>624<br><br><b>Baskı Yılı: </b>2015<br><br><br><b>Dili: </b>Türkçe<br><b>Yayınevi: </b>Abaküs Kitap</p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n                <p>Henüz yorum yapılmadı!</p>\n            </div>", "detail": null}]},
{"product_name": "C Programlama Dili", "author": "Rifat Çölkesen", "publisher": "Papatya Bilim", "content": "<p><br>Ülkemizde büyük kabul gören ve hemen hemen herkesin referans olarak gösterdiği bu eser \"C programlama Dili\"ni öğretmek üzere hazırlanmıştır.  Amacı, bu konuda bir standart ANSI C'yi temel alarak, günümüzdeki bütün modern programlama dillerine yol gösteren C Programlama Dili'ni öğretmek ve ciddi bir temel kazandırmaktır.<br><br>Kitapta, C Programlama Dili'nin değişkenleri, veri türleri, operatörleri, döngü deyimleri ve karşılaştırma deyimleri gibi konularda temel bilgiler verilmiş, sonra ileri düzey sayılabilecek konular ve sistem programlamada kullanılan kütüphane fonksiyonları (sistem çağrıları) da ele alınmıştır. Örneğin, ANSI C'de bulunan tüm kütüphane fonksiyonlarına ek olarak UNIX işletim sisteminin disk dosyalarında kullanılan sistem çağrıları, bir C derleyici paketinin grafik ve port erişim fonksiyonları da incelenmiştir.  <br><br>Bu kitap, \"C Programlama Dili\"ni hem öğrenmek hem de bu konuda derinlemesine bilgi edinmek isteyenlere önerilmektedir.<br><br><br><br><b>Sayfa Sayısı: </b>376<br><br><b>Baskı Yılı: </b>2015<br><br><br><b>Dili: </b>Türkçe<br><b>Yayınevi: </b>Papatya Yayıncılık</p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n                <p>Henüz yorum yapılmadı!</p>\n            </div>", "detail": null}]},
{"product_name": "Projelerle Arduino", "author": "Sertan Deniz Saygılı", "publisher": "Abaküs Kitap", "content": "<p><br><b>Projelerle Herkes için Arduino!</b><br>Uygulamalarla Arduino kitabı birçok sensör ve komponenti içeren uygulamaları ve üç buçuk saati aşan uygulama videolarıyla, Arduino öğrenmek isteyenler için kapsamlı bir eğitim seti. Projelerle Arduino öğrenmeniz için derin bir elektronik bilgisi gerekmiyor. Eğitim seti, herkesin kolaylıkla uygulama geliştirebileceği, interaktif projeler yapabileceği tarzda hazırlandı. <br><br>Arduino ile ilgili komutları öğretirken, teorik bilgilerin içinde boğmak yerine, doğrudan uygulamaların içinde kullanarak anlatan kitap, bu sayede sizi, kısa sürede, Arduino konusunda başlangıçtan ileri seviyelere taşıyor. Kitapta birçok sensörün dışında, sadece kendileri bile başlı başına birer kitap konusu olan RFID, C# ile Seri İletişim, Bluetooth Kontrollü ArduCar ve Engelden Kaçan Robot uygulamaları da mevcut. Kitabın ve DVD'nin içeriğinde anlatılan uygulamalar ile alakalı malzemeler robotistan.com sitesinden Arduino Proje Seti başlığı altında görülebilir.<br><br><b>Kitap İçeriği;</b><br>Breadboard Kullanımı<br>Kızılötesi Sensör<br>Joystick Uygulaması<br>Park Sensörü<br>LCD Ekran Uygulaması<br>RFID Uygulaması<br>Hareket Sensörü<br>C# ile Seri İletişim<br>Engelden Kaçan Robot<br>Bluetooth Kontrollü ArduCar<br>Arduino Phone<br><br><b>Eğitim Videoları İçeriği;</b><br>8x8 Matris Uygulaması<br>Arduino ile Led Yakma<br>Ateş Algılayıcı Sensör Uygulaması<br>Butondan Değer Okuma<br>Buzzer<br>C# ile Seri İletişim<br>DHT11 Uygulaması<br>Engelden Kaçan Robot<br>Gaz Sensörü<br>Hareket Sensörü Uygulaması<br>HC-SR04<br>Joystick Uygulaması<br>Karanlıkta Yanan Led Uygulaması<br>Kızılötesi Sensör Uygulaması<br>LCD Ekran<br>Mikrofon Uygulaması<br>Park Sensörü<br>RFID Uygulaması<br>RGB Led Uygulaması<br>Röle Uygulaması<br>RTC Uygulaması<br>Servo Motor Uygulaması<br>Su Seviyesi / Yağmur Sensörü Uygulaması<br>Arducar<br>7 Segment Ekran<br><br><br><br><b>Sayfa Sayısı: </b>184<br><br><b>Baskı Yılı: </b>2016<br><br><br><b>Dili: </b>Türkçe<br><b>Yayınevi: </b>Abaküs Kitap</p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n               <strong>\n                   Yeni Başlayanlar İçin\n               </strong>\n               <p>Yeni başlayacak arkadaşlar için tavsiyemdir. Kolay, basit ve anlaşılır bir kitap çekinmeden alın. (Bu arada sakın CD içerisindeki kodları kopyala yapıştır yapıp kolaya kaçmayın. :))</p>\n           </div>", "detail": "<div class=\"comment-details\">\n               <p>26.04.2016</p>\n           </div>"}]},
{"product_name": "Jquery", "author": "Salih Baltalı", "publisher": "Kodlab", "content": "<p><br>Bu kitapta akıcı, anlaşılır bir dil kullanmaya çalışılmıştır. Konuyu dağıtmadan meseleyi, az ve öz anlatılmıştır. Kitap içerisinde 3 ana bölüm bulunmaktadır. 600’den fazla ufak örnek, 50 adet uygulamalı örnek sunulmuştur. jQuery kütüphanesinde JavaScript komutları oldukça fazla ve ayrıca programlama mantığını da bilmek gerektiğinden JavaScript konusunu 2. bölümde anlatılmıştır. Buna ek olarak amaç web siteleri veya görsel sistemler tasarlamak olduğundan hareketle CSS konusunun da bilgi sahibi olunması gerekmektedir. Bu yüzden 1. bölümde de CSS konusu anlatılmıştır. jQuery’de metotların pekiştirilmesi için CSS ve JavaScript konuları da değinilmiştir. Konuları sırası ile sabırla uygulama yaparak çalışırsanız kitabı bitirdiğinizde web tasarımında yeni bir yetenek kazanmış olacaksınız. Web sitesi tasarlamaya yeni başlayan ve mevcut siteleri geliştiren kişilerin bilmesi gereken konular bu kitapta etraflıca anlatılmıştır. Zaten anlatılan 3 ana bölüm altındaki konular ile bir web sitesinde yapılması gerekenleri barındırmaktadır. Asgari olarak bilinmesi gerekenler anlatılmıştır. Gerektiği yerde detaya girilmiştir. Kitapta anlatılan her metot veya fonksiyon hakkında en az bir örnek yapılmıştır. Bu örnekler bahsi geçen metodu veya fonksiyonun ne yaptığı veya nasıl çalıştığını anlatmak içindir. Ayrıca her konu sonunda daha somut ve kullanılabilir uygulamalı örnekler verilmiştir. Bu örnekler genellikle web geliştiricilerinin çokça kullandığı veya ihtiyaç duyduğu örneklerdir. Böylece jQuery dilini uygulamalı olarak etkin bir şekilde öğreneceksiniz. Kitapta Geçen Başlıklar • DOM Yapısı • Seçiciler (Selectors) • Filtreler (Filters) • Sıradışı (Traversal) Seçim Fonksiyonları • Çekirdek Yapısı (Core) • DOM Nesnelerini Manipüle Etme • Ölçü ve Pozisyon Fonksiyonları (Dimension Functions) • Olay Fonksiyonları (Event Functions) • Efektler (Effects) • AJAX Metodları • Yardımcı Metodlar • Tabloları jQuery ile Manipüle Etme • PHP, MySQL ve JSON ile Uygulama Örneği • Otomatik (Autocomplete) Tamamlama • Sekmeli (Tabs) Sayfalar • Açılır-Kapanır (Accordion) Alan Yapımı • Değişen Alan Yapımı • Dinamik Yorum Ekleme • RSS Dosyasından Veri Çekme • Datetimepicker (Takvim) Uygulaması • AJAX ile XML Dosyadan Okuma • Kayan Alan Yapımı • jQuery ile Input Giriş Değerlerini Formatlamak (Mask) • jQuery ile Sürükle-Bırak Uygulaması (Drag-Drop) Yazar Hakkında; Salih BALTALI, 1980 Sivas doğumludur. 1999’da Sivas Teknik ve Endüstri Meslek Lisesi Bilgisayar Bölümü’nden mezun olmuştur. Selçuk Üniversitesi Bilgisayar Öğretim Teknolojileri Öğretmenliği’ni 2004 yılında bitirdi. Türkiye’nin değişik yerlerinde çalıştıktan sonra halen Bursa’da görevine devam etmektedir. Bilgiyi eyleme geçirme felsefesiyle hareket edip birçok yerde kurslar açıp programlama dilleri anlatmıştır. Ayrıca değişik zamanlarda ihtiyaçlara göre programlama ve tasarım alanında görev yapmaya devam etmektedir.<br><br><br><br><b>Sayfa Sayısı: </b>410<br><br><b>Baskı Yılı: </b>2015<br><br><br><b>Dili: </b>Türkçe<br><b>Yayınevi: </b>Kodlab</p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n                <p>Henüz yorum yapılmadı!</p>\n            </div>", "detail": null}]},
{"product_name": "Matlab Eğitim Seti", "author": "Cemalettin Kubat", "publisher": "Abaküs Kitap", "content": "<p><br>Matlab, Matrix Laboratory (matris laboratuvarı) kelimelerinin ilk üç harfi alınarak oluşturulmuş bir kelimedir. Matlab teknik bir programlama dilidir. İlk sürümünden bu zamana kadar geçirdiği aşamalara bakıldığında, bu dile yatırım yapanları pişman etmeyecek bir performansa sahip olduğu rahatlıkla söylenebilir. Matlab'ın arka planında çok ciddi akademik çalışma bulunmaktadır. Bu tür programlama dilini ve imkânlarını ülkemizin akademik ve endüstri dünyasına tanıtmak bizler için bir zorunluluktu. Matlab; kontrol, görüntü işleme, istatistik, optimizasyon, bulanık kontrol, sinir ağları, sayısal işaret işleme, güç sistemleri, filtre dizaynı, genetik algoritma, grafik, veri tabanı, web sunucusu, finans vb. gibi saymakla bitiremediğimiz bir çok alanda güvenli bir şekilde kullanılabilecek araç kutuları (toolbox) içerir.<br><br>Kitap hazırlanırken şu amaçlandı; Matlab'ın bilgisayarlarda kullanımından başlayarak temel özelliklerini ve imkânlarını tanıtmak suretiyle öğrenci, araştırmacı ve akademisyenlerin matematik kullanma ihtiyacını gidermeli, her seviyede karşılaşılacak problemin çözümünde rahatlık sağlamalı, fazla ayrıntıya girmeden kullanışlı olmalı, kolayca anlaşılabilen, karmaşık problemlerin çözümünü kolaylaştırıcı tarz ve özelliğe sahip, her seviyeden öğrenen ve öğretenlerin bu konuda el altı kitabı olmalı idi. Bu amaçlar göz önüne alınarak yazılan kitap Fen Bilimleri (Matematik, Fizik, Kimya), Teknik Bilimler (Mühendislik ve Teknik Eğitim) ve Sosyal Bilimler (İktisat, İşletme…) vb. alanlardaki öğrencilerin, araştırmacıların ve eğiticilerin ihtiyaç duyduğu analitik ve sayısal yöntemlerin kolayca kullanımını sağlama düşüncesi önde tutularak hazırlanmıştır.<br><br>Kitaba çok çeşitli alanlarda kullanılan matematik yöntemle ilgili Matlab komutlarının yanında, kullanıcının Matlab'ı bilgisayarına nasıl yükleyeceği ekran görüntüleriyle verilmiş, devamında bir problemin matematik çözümüne nasıl sistematik yaklaşılacağı belirtilmiş, daha sonraki bölümlerde ise gerekli komutlar sırasıyla verilmiştir. Burada Matlab komutları tanıtılırken halen okutulmakta olan çeşitli kaynaklardan, özellikle gerçek dünya problemlerini tanıtan örnekler seçilmeye çalışılmış, böylece öğrenci ve araştırmacıların öğrenmelerinin teşvik edilmesi ve çekiciliğin sağlanması amaçlanmıştır. Kitabın 20. Bölümüne çeşitli konularda çalışan çok sayıdaki araştırmacı ve öğrencinin çalışmasına yol gösterici olması amacıyla optimizasyon ve programlama ile çözülmüş çeşitli örnek problemler sunulmuştur. Son 3 bölümde ise öğrenci ve araştırmacılar tarafından son zamanlarda giderek ilgi duyulan yapay zekâ tekniklerinden en çok kullanım alanı bulan ve Matlab'da yer alan araç kutuları (toolbox) Bulanık Mantık(Fuzzy Logic), Yapay Sinir Ağları (Neural Network) ve Genetik Algoritmalar(Genetic Algorithms) tanıtılmış, bu üç tekniğin anlaşılması ve uygulanmasını kolaylaştıran örneklere yer verilmiştir.<br><br>Kitabın sonunda her bir komutun özellikle tanıtıldığı ve ilgi çekici örneklerin bulunduğu bölümlerdeki sahife numaralarını belirten Komutlar İndeksi verilerek de başka bir kolaylık sağlanmıştır. Kitabın çeşitli derslerle ilgili matematik yöntemlerin bilgisayar yardımıyla uygulanmasını kolaylaştırıcı yönüyle önemli bir boşluğu dolduracağı, ön lisans, lisans, yüksek lisans ve doktora seviyesindeki değişik alanlarda yer alan öğrenci, araştırmacı ve eğiticilerin ihtiyacına cevap vereceğini umuyoruz.<br><br>Kitap İçeriği<br></p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n                <p>Henüz yorum yapılmadı!</p>\n            </div>", "detail": null}]},
{"product_name": "C# 6.0", "author": "Volkan Atasever", "publisher": "Level", "content": "<p><br>C# 6.0 programlama dilini baştan sona size öğreten ve uygulayan bir kitabı elinizde tutmaktasınız. Visual Studio 2015 sürümünde gelen Cross Platform desteği ile Microsoft teknolojileri daha fazla değer kazanmıştır. iOS ve Android uygulamalarını Visual Studio 2015 ile birlikte geliştirebilmektesiniz. Bu programlama dilinin yükselişini gösterirken, aynı zamanda bu programlama dilini bilerek okulunuzda veya iş yaşamınızda bir adım daha öne geçeceksiniz. C# programlama dili Nesne Yönelimli bir dil olduğu için bu kavramlar ve nasıl uygulanacağı size ayrıntılarıyla anlatılmıştır. C# programlama dilini hem görsel hem de kodsal olarak öğrenebilmeniz hedeflenmiştir. Veri tabanı programlama ile temel veritabanı işlemlerinizi gerçekleştirebilirsiniz. REST ve SOAP web servisleri bu kitapta ayrıntılarıyla ele alınmıştır. Büyük bir uygulama geliştirmek için fazla beklemenize gerek yok; hemen C# 6.0 programlama dilini öğrenerek büyük projeler içine girebilirsiniz.<br><br>-C# Nasıl Doğdu ve Nasıl Gelişti<br>- Visual Studio 2015'i İnceleme ve Tanıma<br>-Windows Form Bileşenlerini Tanıma<br>-Temel Veri Tipleri ve Değişkenler<br>-Operatörler, Döngüler ve Deyimler<br>-Diziler ve String'ler<br>-Test ve Hata Yakalama<br>-Sınıflar, Nesneler ve Metotlar<br>-Kalıtım<br>-Indeks'leyiciler ve Özellikler<br>-Interface, Structure ve Enumaration<br>-Grafik Programlama<br>-I/O (Input/Output) İşlemleri<br>-Delegeler ve Olaylar<br>-Jenerik Koleksiyonlar, StringBuilder, Regular Expression, Bellek Yönetimi<br>-Çok kanallı, Asenkron ve Paralel Programlama<br>-Internet ve Ağ Uygulamaları<br>-Veri Tabanı İşlemleri<br>-XML ve Web servisleri ile çalışmak<br>-LINQ (Language Integrated Query)<br>-Java ile C# arasındaki benzerlik<br>-TFS Kullanımı<br>-Mobil Programlama<br>-C# ile Algoritma Örnekleri<br><br>Kitaptaki konuların ana başlıkları:<br><br>1. Bölüm: C# Nasıl Doğdu ve Nasıl Gelişti?.<br>2. Bölüm: Visual Studio İnceleme ve Tanıma<br>3. Bölüm: Windows Form Bileşenlerini Tanıma ve Kullanma<br>4. Bölüm: Temel Veri Tipleri ve Değişkenler<br>5. Bölüm: Operatörler, Döngüler ve Deyimler<br>6. Bölüm: Diziler ve String'ler<br>7. Bölüm: Test ve Hata Yakalama<br>8. Bölüm: Sınıflar, Nesneler ve Metotlar<br>9. Bölüm: Kalıtım<br>10. Bölüm: Indeksleyiciler ve Özellikler.<br>11. Bölüm: Interface, Structure ve Enumaration<br>12. Bölüm: Grafik Programlama<br>13. Bölüm: I/O (Input/Output) İşlemleri<br>14. Bölüm: Delegeler ve Olaylar<br>15. Bölüm: Jenerik Koleksiyonlar, StringBuilder, Regular Expression, Bellek Yönetimi<br>16. Bölüm: Çok Kanallı, Asenkron ve Paralel Programlama<br>17. Bölüm: Internet ve Ağ Uygulamaları<br>18. Bölüm: XML ve Web Servisleri ile Çalışmak<br>19. Bölüm: LINQ (Language Integrated Query)<br>20. Bölüm: Java ile C# Arasındaki Benzerlik.<br>21. Bölüm: C# ile iOS ve Android Uygulamaları Geliştirme<br>(Tanıtım Bülteninden)<br><br><br><br><b>Sayfa Sayısı: </b>526<br><br><b>Baskı Yılı: </b>2015<br><br><br><b>Dili: </b>Türkçe<br><b>Yayınevi: </b>Level</p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n               <strong>\n                   İçerik\n               </strong>\n               <p>Merhaba, kitabı aldım. Google Translate ile çevrilmiş gibi, devrik cümleler, anlaşılmaz örnekler, çok pişman oldum aldığıma.</p>\n           </div>", "detail": "<div class=\"comment-details\">\n               <p>20.10.2016</p>\n           </div>"}]},
{"product_name": "Bilgisayar Ağlarında Saldırı ve Savunma", "author": "Gökhan Usta", "publisher": "Seçkin Yayıncılık", "content": "<p><br>Mesleğe gereği, çok sayıda network (ağ) sistemi kurulumu yapan ve bu networklerin güvenliği konusunda uzmanlaşmış olan yazar, edindiği bilgi ve tecrübeleri bu kitaba aktarmıştır. Günümüzde kötü amaçlı yazılımlar ve çeşitli saldırı yöntemleri sistem güvenliğini tehdit etmektedir. Kurumlarda bilgi sızmasına ve kaybına neden olan asıl önemli saldırılar kurum içerisinden gerçekleştirilmektedir. Bu kitapta bankalar, mağazalar, kamu kurumları, şirketler gibi kapalı iç ağa sahip ağların kendisine ve diğer kullanıcı bilgisayarlarına yapılabilecek saldırılar ve bu saldırılara karşı alınabilecek önlemler kapsamlı, karşılaştırmalı ve pratik olarak ele alınmıştır.<br><br>Güvenliği sağlamanın yolu, saldırıların nasıl gerçekleştirildiğini bilmekten geçmektedir. Bilgisayar ağlarında cihaz veya network protokollerinin çalışma prensiplerinden ortaya çıkan açıklıklar ve bu açıklıklara yönelik alınabilecek tedbirler (switch konfigürasyonu, sistem kurumu veya politika olarak) kitapta detaylı olarak verilmektedir. Ayrıca bu açıklıkları kullanan yazılım araçları ile bir saldırının nasıl gerçekleştirildiğini kitabın ekinde ücretsiz olarak verilen DVD'deki videolardan izleyebilir; DVD ile sunulan Kali Linux,  Virtual Box, GNS3 gibi yazılımlardan faydalanarak kendi ağınızı oluşturarak test ve denemelerinizi sanal ortamda kendiniz yapabilirsiniz.<br><br>Kitapta Bulunan Konu Başlıkları;<br><br>-Bilgisayar Ağlarında Güvenlik Kavramı<br>-Bilinmesi Gereken Temel Network Bilgileri<br>-Ethernet Anahtar Cihazının Mac Tablosuna Yapılan Saldırılar<br>-Arp Protokolünün Zayıflıkları Kullanılarak Yapılan Saldırılar<br>-DHCP Sunucuya Ve DHCP Protokolüne Yapılan Saldırılar<br>-802.1 Q Protokolüne Yapılan Saldırılar<br>-Spanning Tree Protokolüne Yapılan Saldırılar<br>-Sanal Yönlendirici Yedeklilik (VRRP) Protokolüne Yapılan Saldırılar<br>-Ethernet Üzerinden Güç Aktarma Protokolüne Yapılan Saldırılar<br>-Ethernet Anahtar Cihazın Kendisine Yapılan Servisin Durdurulması Saldırıları<br>-Diğer Saldırı Tipleri<br>-SDN (Software Defined Networks) ve Open Flow<br> (Tanıtım Bülteninden)<br><br><br><br><b>Sayfa Sayısı: </b>142<br><br><b>Baskı Yılı: </b>2015<br><br><br><b>Dili: </b>Türkçe<br><b>Yayınevi: </b>Seçkin Yayıncılık</p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n                <p>Henüz yorum yapılmadı!</p>\n            </div>", "detail": null}]},
{"product_name": "Illustrator Cs6", "author": "Yavuz Gümüştepe", "publisher": "Kodlab", "content": "<p><br>Dünyada ülkelerinin yüzde 80inde Adobe Illustrator web arayüzü tasarımından illüstrasyon tasarımına masaüstü yayıncılıktan kurumsal kimlik çalışmalarına kadar birçok alanda aktif olarak kullanılıyor. <br><br>Ülkemizde birçok iş alanında da Adobe Illustrator kullanıcıları gün geçtikçe çığ gibi büyümektedir. <br><br>Bu noktadan hareketle hazırladığımız Adobe Illustrator CS6 kitabı en alt seviyeden başlanarak her kullanıcıya hitap edecek bir şekilde tasarlandı. Kitap içerisinde temel birçok konuya yer vermenin yanı sıra kitap ile birlikte edineceğiniz CD ile öğretici görsel uygulamalara da sahip olacaksınız. Bu bağlamda kitap içerisindeki konuları çalışarak ve CD içerisindeki örnek uygulamaları yaparak kolay ve zevkli bir şekilde Adobe Illustrator kullanımını öğrenebilirsiniz. <br><br>Kitap içerisinde Adobe Illustrator la ilgili temel bilgilerin yanı sıra basit ve karmaşık çizimler yapma çizimleri boyama biçimlendirme katmanlarla çalışma bitmap resimleri vektörel resimlere dönüştürme yazı ile çalışma 3 boyutlu çizimler yapma gibi birçok konu anlatılmaktadır. Ayrıca her bölümün sonunda bölüm içerisindeki bilgileri pekiştirmek için görsel uygulamalar yer almaktadır.<br><br><br><br><b>Sayfa Sayısı: </b>480<br><br><b>Baskı Yılı: </b>2015<br><br><br><b>Dili: </b>Türkçe<br><b>Yayınevi: </b>Kodlab</p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n                <p>Henüz yorum yapılmadı!</p>\n            </div>", "detail": null}]},
{"product_name": "HTML5 & CSS3", "author": "Fahrettin Erdinç", "publisher": "Pusula Yayıncılık", "content": "<p><br>Fahrettin Erdinç, web tasarımına ve HTML'e yeni başlayanları hedef alarak yazdığı bu kitapta,  fazla teoriye kaçmadan, konuya odaklanarak, kolay anlaşılacak örneklerle web tasarım mantığını anlatıyor, HTML 5 ve CSS 3'ün yeni olanaklarını örneklerle okura sunuyor. <br>Kitapta Web sayfalarının oluşturulması süreci anlatılırken, Steve Champeon'ın \"Aşamalı Geliştirme\" yaklaşımını kullanıldı. Bu yaklaşımda amaç, önce basit bir sayfa oluşturup zamanla eklemeler yaparak daha karmaşık sayfalar oluşturmaktır. Bu yöntemde, önce HTML kodları yazılıyor ve okurla birlikte doğru çalışıp çalışmadığı test ediliyor. Daha sonra CCS kodları eklenip sayfa daha görsel hale getiriliyor. Son olarak da Javascript ve ilgili kütüphaneleri kullanarak daha etkileşimli sayfalar oluşturuluyor. Fahrettin Erdinç, web teknolojisinin en yeni araçlarını kullanarak, web sayfası tasarımının temel mantığını herkesin anlayabileceği bir şekilde adım adım anlatıyor. Bu da kitabı, hiç HTML ve CSS bilmeyip öğrenmek isteyen veya var olan HTML/CSS bilgisini geliştirmek isteyenler için ideal başvuru kaynağı haline getiriyor.<br>(Tanıtım Bülteninden)<br><br><br><br><b>Sayfa Sayısı: </b>280<br><br><b>Baskı Yılı: </b>2016<br><br><br><b>Dili: </b>Türkçe<br><b>Yayınevi: </b>Pusula Yayıncılık</p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n                <p>Henüz yorum yapılmadı!</p>\n            </div>", "detail": null}]},
{"product_name": "Aldatma Sanatı", "author": "Kevin D. Mitnick", "publisher": "Odtü", "content": "<p><br>Antivirüs yazılımları, yazılım ve donanım temelli güvenlik sistemleri, kameralar, manyetik kartlar, güvenlik görevlileri vs... bunların hiçbiri, devletlerin, şirketlerin ve şahısların bilgi güvenliğini garanti edemiyor.<br><br>Bilgisayar korsanlığı (hacker'lık) suçundan hapse giren, dünyanın ilk dijital suçlusu Kevin Mitnick, bilgi güvenliği konusuna artık diğer cepheden bakıyor: Dünyanın en pahalı güvenlik sistemlerinin birkaç basit telefon konuşmasıyla ve bilgisayar klavyesine bile el sürmeden nasıl alt edilebileceğini gösteren Mitnick, bilgi güvenliği sürecinin iyileştirilmesi için alınması gereken önlemleri sıralıyor. Bunlar, bir sihirbazın göz yanılsaması oyunları değil, tescilli bir toplum mühendisinin tecrübelere dayanan tavsiyeleridir.<br><br>Şirketinizin yeni geliştirdiği ürünler hakkındaki bilgileri, rakiplerinizin, sizin ruhunuz bile duymadan ele geçirmelerini istemiyorsanız; ya da milyonlarca müşterinin kimlik ve hesap bilgilerini tutan bir finans kuruluşunda çalışıyorsanız, toplum mühendisliğinin ne olduğunu ve nasıl zararlar verebileceğini öğrenmek için bu kitabı mutlaka okumalısınız.<br><br>Elektronik posta kullanıyorsanız, internete giriyorsanız, herhangi bir şekilde bilgisayar ağları üzerinde kişisel bilgilerinizi tutuyorsanız ve bilgisayar aracılığıyla alışveriş ya da bankacılık işlemleri yapıyorsanız bu kitabı mutlaka okumalısınız.<br><br>Aldanmamak için aldatma sanatının inceliklerini öğrenmelisiniz.<br><br><br><br><b>Sayfa Sayısı: </b>336<br><br><b>Baskı Yılı: </b>2016<br><br><br><b>Dili: </b>Türkçe<br><b>Yayınevi: </b>Odtü</p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n               <strong>\n                   Yorum\n               </strong>\n               <p>Açıkçası çok büyük hevesle sipariş ettiğim bu kitabı beğenmedim. İnsanların bazen çok dalgın olabileceği dışında bilgi vermiyor. Yazarın kendini beğenmiş, herkesi küçük gören bir anlatımı var. Tavsiye etmiyorum.</p>\n           </div>", "detail": "<div class=\"comment-details\">\n               <p>30.12.2013</p>\n           </div>"}]},
{"product_name": "Yeni Başlayanlar İçin Arduino", "author": "Fahrettin Erdinç", "publisher": "Pusula Yayıncılık", "content": "<p><br>Arduino ile kendi robotunuzu ve entegre sistemlerinizi geliştirin! İhtiyacınız olan iki şey var: Arduino seti ve bu kitap...<br><br>Son yıllarda en popüler açık kaynak kodlu geliştirme platformu haline gelen Arduino'yu Fahrettin Erdinç herkesin anlayabileceği bir şekilde ele alıyor. <br><br>Açık kaynak kodlu yazılımların donanımdaki bir karşılığı olan Arduino, benzerleri gibi, belirli kişiler veya kurumlar tarafından tasarlanarak üretilen, devre şemaları herkese açık olan ve diğer kişiler tarafından da üretilebilen donanımlar içerir. Arduino tek bir donanım olmayıp, bir geliştirme platformudur, başarısının arkasında yatan en önemli etken de açık kaynak kodlu oluşudur.. Arduino'nun popülerliğini sağlayan en önemli şey, mikro denetleyiciler konusunda çok fazla şey bilmeyen kullanıcıların da Arduino kütüphanelerini kullanarak rahatlıkla proje geliştirebilmeleridir.<br><br>Bu kitap, size Arduino ile yapabileceklerinizi en başından adım adım gösterecek. Öncelikle programlama konusunda bilgi sahibi olmalısınız. Bu nedenle de kitabın başlangıç bölümleri programlamanın temellerine ayrılmıştır.  Arduino ile uygulamalar yapabilmek için, programlamanın dışında temel elektronik bilgilerine de sahip olmanız gerekiyor. Kitabın ileriki bölümlerinde, temel elektronik bilgilerinin yanı sıra, donanıma ve mikro denetleyicilere yönelik somut uygulamalar yer alıyor: Analog ve dijital sinyaller nasıl alınır, nasıl işlenebilir? Sensörlerden gelen sinyaller nasıl kullanılır? Çevresiyle iletişime geçebilen düzenekler ve basit robotlar nasıl yapılabilir? Arduino ile bilgisayarınızı nasıl dış ortamla etkileşebilir hale getirebilirsiniz?<br>(Tanıtım Bülteninden)<br><br><br><br><b>Sayfa Sayısı: </b>436<br><br><b>Baskı Yılı: </b>2016<br><br><br><b>Dili: </b>Türkçe<br><b>Yayınevi: </b>Pusula Yayıncılık</p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n                <p>Henüz yorum yapılmadı!</p>\n            </div>", "detail": null}]},
{"product_name": "Arduino", "author": "Coşkun Taşdemir", "publisher": "Dikeyeksen", "content": "<p><br>İleri seviyede elektronik ve yazılım bilgisine sahip olmayan kişilerin de kolaylıkla interaktif projeler oluşturmasını sağlamak amacıyla tasarlanmış olan Arduino bugün dünyanın en popüler açık kaynak donanım projelerinden birisi haline gelmiş durumdadır. Bu kitapla Arduino ile tanışarak interaktif elektronik projeleri nasıl gerçekleştirebileceğinizi öğreneceksiniz. Yapabileceklerinizin hayal gücünüzle sınırlı olduğu Arduino dünyasına hoşgeldiniz!<br><br>İnsansız hava araçları alanında ar-ge mühendisliği yapmış, milli insansız araç projelerinde yer almış ve halen Siemens'de ar-ge mühendisi olarak çalışan Elektronik Mühendisi Coşkun Taşdemir'in sade ve anlaşılır anlatımıyla Arduino'da sağlam adımlarla ilerleyeceksiniz. Kitapta anlatılan konuların başlıcaları şöyle:<br><br></p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n               <strong>\n                   Kitap Güzel\n               </strong>\n               <p>Özellikle mikrodenetleyici dünyasına giriyorsanız ve elinizde Serdar Çiçek'in PIC Programlama kitabı yoksa bu kitap bence ideal.</p>\n           </div>", "detail": "<div class=\"comment-details\">\n               <p>04.05.2014</p>\n           </div>"}, {"content": "<div class=\"comment-content\">\n               <strong>\n                   bu kitapda bazı eksiklikler var\n               </strong>\n               <p>Kitap hiç elektronik bilgisi olmayan biri için bulunmaz bir nimet fakat içeriginde interrup kesmeleri (timer kesmeleri hariçi giriş kesmeleri rs232 kesmeleri i2c kesmeleri vb.) eksik. Uygulamamarda bütün  çıkış portlarına veriler bit bazında verilmiş (örnegin 7 segment gösterge uygulaması displayde 8 verisini yakmak için 7 tane komut kullanılmış 0xff verisinin bir porta nasıl gönderileceği yok )<br>kitapda micro c veya ccs c programlama dilerini bilen biri için çok az yeni öğreneceği bilgi var.</p>\n           </div>", "detail": "<div class=\"comment-details\">\n               <p>21.09.2012</p>\n           </div>"}]},
{"product_name": "SQL Server 2016", "author": "İsmail Adar", "publisher": "Abaküs Kitap", "content": "<p><br>Veri Tabanı Yönetimi için Temel Başvuru Kaynağı!<br>5 Saati Aşkın Video Eğitimiyle Birlikte<br><br>Dünyanın en yaygın kullanılan veri platformu SQL Server'ın son sürümü Microsoft SQL Server 2016 ile artan veri hacminin getirdiği zorlukların üstesinden gelerek boyutu ve formatı ne olursa olsun verilerin hızla yararlanılabilir iş bilgilerine dönüştürülmesine olanak sağlıyor. Birçok firma tarafından tercih edilen Microsoft SQL Server'ın bir kurumun tüm ihtiyaçlarına cevap verebilecek bir veritabanı yönetim sistemi olmasıyla bu yöndeki uzman personel ihtiyacı da aynı oranda artmıştır. Günümüzde hâlâ çok popüler olan Veritabanı Yöneticiliğine ilk adımı atmak için elinizdeki bu kitap size hem Microsoft SQL Server ile veritabanı üzerinde sorgulama yapmak hem de geliştirdiğiniz uygulamalarda kullanabileceğiniz ileri seviye TSQL yetkinliği kazanma imkânı sunuyor.<br><br>Microsoft SQL Server 2016 ile ilgili olarak yazılan ilk Türkçe kitap olma niteliğini taşıyan bu kitabın temel amacı bilişim teknolojileri alanında büyük bir eksiklik olan Türkçe kaynak ihtiyacını bir nebze de olsa azaltabilmektir.<br><br>Elinizdeki bu kitap Microsoft SQL Server 2016 için bir referans kitabı olmanın ötesinde SQL Server 2016'yı kurmak, etkin bir şekilde kullanmak ve SQL Server 2016'yı kullanarak veritabanı çözümleri ve programlaması yapmayı özgün senaryo ve örneklerle ele alan bir kitaptır. Ayrıca bu kitap daha önceden hiç SQL Server bilgisi olmasa bile temel düzeyde sistem veya yazılım bilgisi olan ve SQL Server öğrenmek isteyen veya var olan SQL Server bilgisini üst noktalara taşımayı amaçlayan kişilere hitap etmektedir.<br><br></p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n                <p>Henüz yorum yapılmadı!</p>\n            </div>", "detail": null}]},
{"product_name": "Veri Madenciliği Yöntemleri", "author": "Yalçın Özkan", "publisher": "Papatya Bilim", "content": "<p><br>Bu kitap, veri madenciliği yöntemlerini ele alan temel ve nitelikli bir eserdir. Sınıflama, kümeleme ve birliktelik kurallarıyla ilgili birçok algoritma en yalın biçimiyle incelenmiştir.<br><br>Veri madenciliği, kurumların zaman içerisinde sahip olduğu büyük boyutlardaki verilerden alışılagelen istatistik yöntemlerle elde edilemeyen veya elde edilmesi güç olan bilgileri elde etmek için bir çeşit verileri işleme ve çözümleme yöntemidir. Yani sahip olduğumuz veri kümesinden işimize yarayacak yararlı bilgiyi üretme yöntemidir.<br><br>\"Veri Madenciliği\" adlı bu kitabımızda sırasıyla veri ambarı kavramı, veri madenciliği kavramı ve kullanım alanları, veri madenciliğinde kullanılan sınıflandırma algoritmaları, Twoing ve Gini algoritmaları, en yakın k-komşu algoritması, kümeleme konusu, hiyerarşik ve hiyerarşik olmayan kümeleme biçimi,  sepet çözümlemeleri adıyla bilinen birliktelik kuralları, \"Bayes ağları\" ve \"Destek Vektör Makineleri\" konusu ele alınmıştır; herbiri bir bölüm olarak düzenlenmiştir.<br><br>Böylesi bir \"Veri Madenciliği\" kitabı hem profesyoneller için yararlı bir başvuru kitabı hem de bilgisayar mühendisliği, matematik-bilgisayar, yönetim bilişim sistemleri, endüstri mühendisliği, yazılım mühendisliği gibi mühendislik ve sosyal bilimlerde dört yıllık lisans ve meslek yüksek okulu öğrencileri için yararlı bir ders kitabı özelliğindedir.<br>(Tanıtım Bülteninden)<br><br><br><br><b>Sayfa Sayısı: </b>240<br><br><b>Baskı Yılı: </b>2016<br><br><br><b>Dili: </b>Türkçe<br><b>Yayınevi: </b>Papatya Bilim</p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n                <p>Henüz yorum yapılmadı!</p>\n            </div>", "detail": null}]},
{"product_name": "Python", "author": "Mustafa Başer", "publisher": "Dikeyeksen", "content": "<p><br>Python, ilk sürümünden (1990 yılının başında) bu yana dikkatleri üzerine çeken genel amaçlı, yorumlamalı, nesne tabanlı, temiz kod yazılabilen, hızlı öğrenilebilen, hızlı uygulama geliştirilebilen ve birçok aracı (kütüphaneyi) içeren bir programlama dilidir. Bu kitap, programcılığa yeni başlayanlar için bir rehber, Python'u bilenler için bir başvuru kaynağı niteliğindedir. <br><br>Python konusunda uzun yıllar yayın üreten, kitaplar yazan ve akademik hayatına bu yönde devam eden Doç. Dr. Mustafa Başer'in 15 yıldan fazla deneyim ve tecrübesine dayanan kitabın başlıca konular şöyle:<br><br></p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n                <p>Henüz yorum yapılmadı!</p>\n            </div>", "detail": null}]},
{"product_name": "Uygulamalarla Siber Güvenliğe Giriş", "author": "M. Alparslan Akyıldız", "publisher": "Gazi Kitabevi", "content": "<p><br><b>İçindekiler</b><br><br>1-Lab İçin Sanal Makina Kurulumu<br>2-Lınux İşletim Sistemine Giriş<br>3-Temel Network Kavramları<br>4-Hedefe Yönelik Bilgi Toplama Ve Zafiyet Analizi<br>5-Reverse Shell Ve Bınd Shell Kavramları<br>6-Explotatıon<br>7-Bufffer Overflow Ve Exploit Geliştirmeye Giriş<br>8-Yerel Ağ Güvenlik Testleri<br>9-Dosya Aktarımları Ve Tünelleme Teknikleri<br>10-Parola Atakları<br>11-Dos (Denail Of Service )Servis Dışı Bırakma Saldırı Testleri<br>12-Kablosuz Ağlara Yönelik Yapılan Güvenlik Testleri<br>13-Web Açıklıkları Ve Tes Etme Yöntemleri<br>14-Voıp Ağlarda Güvenlik Test Uygulamaları <br>15-Sosyal Mühendislik<br>16-Puvotıng<br>17-Ctf Ve Çözümleri<br>18-Pentest Raporu Nasıl Yazılır<br> (Tanıtım Bülteninden)<br><br><br><br><b>Sayfa Sayısı: </b>585<br><br><b>Baskı Yılı: </b>2016<br><br><br><b>Dili: </b>Türkçe<br><b>Yayınevi: </b>Gazi Kitabevi</p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n                <p>Henüz yorum yapılmadı!</p>\n            </div>", "detail": null}]},
{"product_name": "İleri Düzey Excel 2016", "author": "Ömer Bağcı", "publisher": "Seçkin Yayıncılık", "content": "<p><br>Excel programını kullanıyor ve Excel'in gelişmiş özelliklerini kullanarak, Etkin bir Excel kullanım becerisine sahip olmak istiyorsanız Yeni sürüme göre güncellenmiş 7. baskısını yapan bu kitap tam size göre.<br><br>İleri Düzey Excel ve Dashboard Rapor oluşturma eğitimlerinde anlatılan konuları kapsayan ve günlük hayatta kullanabileceğiniz pek bilinmeyen Excel kısa yollarını anlatan bu kitap sayesinde, kursa gitmeye gerek kalmadan Excel bilginizi ileri düzeye taşır, Raporlarınızı kendiniz oluşturabilir ve Excel konusunda uzman olursunuz.<br><br>Türkiye'nin En geniş ve güncel Online Excel eğitim sitesi olan vidoport.com'dan Ücretsiz üyelik hakkı da kazandıran bu kitap ile Excel'de Koşullu Biçimlendirmelerden, veri doğrulama kullanımına, Özet tablolardan Makrolar kullanımına, EĞER İşlevini kullanımından, ÇOKETOPLA gibi işlevlerin kullanımına kadar işlevleri ve işlevlerin ortak kullanımlarını ve Dashboard Rapor oluşturma yöntemlerini rahatlıkla öğrenebilirsiniz. <br><br>Konularına göre dağıtılmış ve toplu olarakda bulunan ipuçları ile Excel'de bilmediğiniz konulardaki Kısa yolları öğrenebilir ve bunların eğitimlerini online olarak izleyebilirsiniz.<br><br>Adları Kullanmak<br>Koşullu Biçimlendirmeler Yapmak<br>Özet Tabloları Kullanmak<br>Hedef Ara ve Senaryoları Kullanmak<br>Alt Toplamlar Almak<br>Grafikler İle Çalışmak<br>3B Haritalar Oluşturmak<br>İşlevleri Kullanmak<br>İşlevlerin Ortak Kullanımları<br>Makroları Kullanmak<br>Excel Çözücüyü Kullanmak<br>Klavye Kısayolları<br>İleri Düzey Uygulamalar<br>Fonksiyonların İngilizce- Türkçe Karşılaştırmaları<br>Dashboard Raporlar Oluşturma<br>(Tanıtım Bülteninden)<br><br><br><br><b>Sayfa Sayısı: </b>495<br><br><b>Baskı Yılı: </b>2016<br><br><br><b>Dili: </b>Türkçe<br><b>Yayınevi: </b>Seçkin Yayıncılık</p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n                <p>Henüz yorum yapılmadı!</p>\n            </div>", "detail": null}]},
{"product_name": "Örneklerle Algoritma ve C# Programlama", "author": "Erhan Arı", "publisher": "Seçkin Yayıncılık", "content": "<p><br>Gördüğü yoğun ilgi sonucunda, gözden geçirilmiş 3. baskısını yapan kitap programlamaya yeni başlayanları da kapsayacak şekilde, programlama ile ilgilenen, günümüzün tercih edilen ve yaygın olarak kullanılan programlama dillerinden biri olan C# dilini öğrenmek isteyen, Bilgisayar Programlama dersini alan tüm eğitim kurumları öğrencilerine yönelik sade ve anlaşılır bir dille yazılmıştır. Kitabı bitirdiğinizde, programlama mantığını ve C# programlama dilini öğrenebileceksiniz.<br><br>Kitap içerisinde temel kavramlar, algoritmalar, akış diyagramları, C# Konuları ve C# ile gerçekleştirilmiş örnekler yer almaktadır. Ayrıca C# diline ait komut ve ifadelerin daha iyi kavranabilmesi için programın kullanılışları uygulamalı olarak anlatılmıştır. Tüm konularda kolaydan zora doğru analiz edilerek çözülmüş örneklere ve konu içlerinde konuların daha iyi kavranabilmesi için çalışma sorularına ve 115'i çözümlü 168 Örnek Çalışmaya yer verilmiş ayrıca tüm sorularda akış diyagramları oluşturularak programlama mantığının öğrenilmesi amaçlanmıştır. Örnek çalışmalar C# derleyicisi tarafından derlenmiş olup, ekran çıktılarına kitap içerisinde yer verilmiştir.<br><br>Eser, üniversitelerde okutulmakta olan temel seviyedeki \"Temel Programlama, Algoritmalar\" derslerine uygun olarak hazırlanmış ve de algoritmalar ve C# dilini kendi kendine öğrenmek isteyenlere de hitap etmektedir.<br><br>Kitapta Bulunan Konu Başlıkları<br>Akış Diyagramları<br>Değişkenler ve Veri Türleri<br>Tür Dönüşümleri<br>C# Programlama Dilinde Operatörler<br>Kontrol Deyimleri<br>Döngü Deyimleri<br>Metotlar<br>Programlama Hataları<br>Dosyalama İşlemleri<br>Veritabanı İşlemleri<br>C# Uygulama Örnekleri<br>(Tanıtım Bülteninden)<br><br><br><br><b>Sayfa Sayısı: </b>328<br><br><b>Baskı Yılı: </b>2016<br><br><br><b>Dili: </b>Türkçe<br><b>Yayınevi: </b>Seçkin Yayıncılık</p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n                <p>Henüz yorum yapılmadı!</p>\n            </div>", "detail": null}]}
][
{"product_name": "Android Studio Üzerinden Anlatımlı Örneklerle Android Programlama Eğitimi - DVD'li", "author": "Aykut Taşdelen", "publisher": "Pusula Yayıncılık", "content": "<p><br>Başlangıçtan ileri seviyeye kadar tüm Android programcıları için hazırlanan bu akademik kaynak, Android Studio üzerinden anlatımlı örneklerle ve uygulamalar içeren DVD ile birlikte geliştiricilere Android'in kapılarını açıyor. <br><br>Bu kitap 2011 yılından beridir, üniversitede Android üzerine açılmış ilk lisans derslerini okutan deneyimli  eğitimci Aykut TAşdelen tarafından kaleme alındı. Bu nedenle kitap, konuları pedagojik bir sistematiğe göre ayrıştırıp, akademik bir ciddiyet içerisinde ele alıyor. Konunun arka planını anlatmayı hedefleyen Taşdelen, ekran görüntüleri ile doldurulmuş yüzeysel içerikli bir kitap yerine, bazı noktalarda Android kütüphanesinin kendi kaynak kodlarından alıntılar yaparak -sadece bir şeyin nasıl yapıldığını değil aynı zamanda o görevi yerine getiren sınıfların nasıl yazıldıklarını anlatıyor- ayrıca UML ile modellemeler yaparak, kütüphanenin tasarım detaylarını da inceliyor. Teori ve pratiğin ayrılmaz bir bütün olduğu gerçeğinden yola çıkılarak, kitap Android üzerine uygulama geliştirme isteyen kişiler için bolca örnek kod içeriyor ve kaliteli kodlama için çeşitli teknikler öğretiyor. <br><br>Java, C# veya C++ dillerinden herhangi birisinde belirli bir seviyeye gelmiş programcılara, Android programlamayı başlangıcından ileri seviyeye kadar öğretmeyi hedefleyen kitap, Android dünyasındaki son yeniliklere göre hazırlandı. Örneğin anlatımlar Eclipse yerine Google'ın resmi IDE olarak kabul ettiği Android Studio üzerinden yapılıyor. Ayrıca Lollipop gibi yeni versiyonlarla gündeme gelmiş olan ART gibi yeni olgular anlatılıyor ve API versiyonlarındaki son güncellemeler ele alınıyor. Kitap C# ve C++ programcıları için Java'nın bu iki dilden farklılıklarını (sıfırdan Java anlatmadan) ek bir bölümde  özetliyor.<br><br>Kitapla birlikte, her bölümde anlatılan kod satırları ile ilgili daha fazla örnek içeren DVD kullanıcılara sunuluyor. DVD'de her bölüme göre ayrı ayrı düzenlendi. Kitapta anlatılan konularla ilgili daha fazla örnek ve kod, Android Studio formatında yer alıyor. <br><br><br><br>Kitapta Yer Verilen Başlıca Konular: <br>   <br>Dalvik, ART, Sandbox, Zygote, Forking, AOT, vb<br>Fragment, Layout ve View Sınıfları<br>YAFSS2 Dosya Sistemi Ve Dosya İşlemleri<br>Shared Preferences, Process'ler<br>MVC Paterni ve Çok Katmanlı Mimari <br>SqLite Veritabanı İşlemleri<br>BLOB verilerle çalışma<br>ContentProvider, Servisler, MultiThreading, Asenkron Çalışma<br>JSON, SOAP ve RESTful Web Servisler <br>Çizim İşlemleri, SurfaceView, Animasyonlar<br>Kamera, Ses Tanıma, Seslendirme  <br>GPS, Sensörler, Broadcasting<br>GoogleMap, Places API'leri <br>SMS, Mail, Arama<br>Bluetooth ve Arduino <br>Java'nın C++ ve C#'tan Farklılıkları  <br>NFC Haberleşmesi<br>Gesture Kullanımı, Validasyon<br>Xamarine ve C# ile Uygulama Geliştirme<br>SwipeDown Gesture<br>Jsoup<br>ConstraintLayout<br>(Tanıtım Bülteninden)<br><br><br><br><b>Sayfa Sayısı: </b>566<br><br><b>Baskı Yılı: </b>2016<br><br><br><b>Dili: </b>Türkçe<br><b>Yayınevi: </b>Pusula Yayıncılık</p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n               <strong>\n                   En iyi kaynak\n               </strong>\n               <p>Eğer biraz programlama bilginiz varsa android studio'yu ve java dilini biraz biliyorsanız, o zaman gelişmeniz için en iyi kaynak. İlk önce konu isminin anlamını açıklayan sonrada örnek kodlarla destekleyen çok güzel bir kitap.</p>\n           </div>", "detail": "<div class=\"comment-details\">\n               <p>07.07.2016</p>\n           </div>"}]},
{"product_name": "Ethical Hacking", "author": "Ömer Çıtak", "publisher": "Level", "content": "<p><br>Hacker'lar temelde Siyah Şapkalı ve Beyaz Şapkalı olmak üzere ikiye ayrılır. Siyah şapkalılar öğrendikleri teknik ve yöntemleri kendi çıkarları ve diğer insanlara zarar vermek için kullanırlar. Beyaz şapkalılar ise siyah şapkalılar ile aynı teknik ve yöntemleri öğrenip; siyah şapkalılar kimseye zarar vermesin diye sistemleri korumaya çalışırlar. Bu kitap da hacking'in temel konuları hem siyah şapka hem beyaz şapka açısından ele alınıyor. Bir tekniğin siyah şapkalı bir hacker bir sisteme zarar vermek için ne şekilde kullanıldığı (offensive) ve ardından bu güvenlik zafiyetinin beyaz şapkalı hacker tarafından nasıl korunacağı (defensive) anlatılıyor.<br><br>Kitap konu içeriği CEH, yani Certified Ethical Hacking ile paraleldir. CEH, siber güvenlik sektöründeki her firmanın en önem verdiği sertifikalardan biridir. Siber güvenlik sektöründe çalışmak isteyip, CEH sınavına hazırlananlar için kitap yardımcı mahiyette olacaktır.<br>(Tanıtım Bülteninden)<br><br><br><br><b>Sayfa Sayısı: </b>256<br><br><b>Baskı Yılı: </b>2016<br><br><br><b>Dili: </b>Türkçe<br><b>Yayınevi: </b>Level</p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n               <strong>\n                   Mükemmel \n               </strong>\n               <p>Kesinlikle öneriyorum mükemmel bir kitap :)</p>\n           </div>", "detail": "<div class=\"comment-details\">\n               <p>07.11.2016</p>\n           </div>"}, {"content": "<div class=\"comment-content\">\n               <strong>\n                   Harika\n               </strong>\n               <p>Sıfırdan başlayıp bir şeyler öğrenmek isteyenler için gayet başarılı bir kitap olmuş ancak almadan önce PHP, SQL, JAVA ve C gibi diller ve konular hakkında biraz bilginiz olmasını düşünerek alın. Bunu alayım Black Hacker olayım diye dalmayın konuya. Bugün geldi 65 sayfa okudum. Hiç bir şey mi olmadı, kültür seviyesini arttırır.</p>\n           </div>", "detail": "<div class=\"comment-details\">\n               <p>11.08.2016</p>\n           </div>"}]},
{"product_name": "Java Programlama Dili ve Yazılım Tasarımı", "author": "Altuğ B. Altıntaş", "publisher": "Papatya Bilim", "content": "<p><br>Bu kitapta, Java programlama dili başlangıçtan ileri düzeye kadar her açıdan ele alınmıştır. Böylesi bir eser bir yazılım tasarımcısının veya bir programcının her zaman elinin altında bulunması gereken klasik bir eser niteliğindedir. Çünkü Java programlama diliyle ilgili, yeni başlayan ve profesyoneller için neredeyse herşey bu kitapta vardır. Yazarının Java konusunda engin deneyimi ve editörünün bilgisayar mühendisliği konusundaki olgunluğu bu kitaba doğrudan yansımıştır ve böyle bir eserin bir benzerini hazırlamak nerede ise imkansız olmuştur.<br><br>Java Programlama dili nesneye yönelik, bir kere tasarla her yerde çalıştır felsefesine dayanan, belleği verimli kullanmak için çöp toplama sistemi olan, güvenli, İnternet ve Web uygulamaları için elverişli (Applet, JSP, Servlet, Corba, RMI, EJB, Apache Wicket) bir tasarım aracıdır.<br><br>(...) Java programlama dili, Sayın Altuntaş'ında belirttiği gibi \"uygulamaların farklı işletim sistemleri üzerinde çalıştırılabilmesi düşüncesiyle geliştirilmiş bir teknolojidir. Java teknolojisi kullanılarak aynı uygulama farklı ortamlarda çalıştırılabilir. Örneğin kişisel bilgisayarlarda, tablet bilgisayarlarda, üstelik cep telefonlarında... Java™ platformu hem programlama dili, hem de bir ortam olarak düşünülebilir. Programlama dili olarak, açık kodlu, nesneye yönelik, güvenli, sağlam, İnternet için elverişli bir teknolojidir denilebilir. Kısaca göz atılırsa Java ile, GUI (Grafiksel Kullanıcı Arayüzü) uygulamaları, Applet'ler, veritabanına erişimle ilgili uygulamalar, Servlet, Jsp (Web tabanlı uygulamalar), dağınık bileşenler, cep telefonları, Smart kartlar için uygulamalar, Apache Wicket ile Web uygulamaları vs gibi birçok alanda -uygulama geliştirilebilir.\" <br>-Dr. Rıfat Çölkesen-<br>(Tanıtım Bülteninden)<br><br><br><br><b>Sayfa Sayısı: </b>720<br><br><b>Baskı Yılı: </b>2016<br><br><br><b>Dili: </b>Türkçe<br><b>Yayınevi: </b>Papatya Yayıncılık</p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n                <p>Henüz yorum yapılmadı!</p>\n            </div>", "detail": null}]},
{"product_name": "Her Yönüyle C# 6.0", "author": "Sefer Algan", "publisher": "Pusula Yayıncılık", "content": "<p></p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n               <strong>\n                   Kitap\n               </strong>\n               <p>başlangıç için bir göz attım anlatımı gayet iyi görünüyor alınabilecek en iyi kitap fiyatı 70 tlden 50 tl ye düşmüştü  bir tek burda buldum alın bence.</p>\n           </div>", "detail": "<div class=\"comment-details\">\n               <p>20.04.2015</p>\n           </div>"}, {"content": "<div class=\"comment-content\">\n               <strong>\n                   Açıklama\n               </strong>\n               <p>Programcılıkta sınır tanımayan bir kaynaktır. Bu işe gönül vermiş bir usta!<br>Kesinlikle kitaplıklarınızda bulunması gereken bir eser?</p>\n           </div>", "detail": "<div class=\"comment-details\">\n               <p>27.05.2013</p>\n           </div>"}]},
{"product_name": "Hacking Interface", "author": "Hamza Elbahadır", "publisher": "Kodlab", "content": "<p><br>Bilişimin Yeraltı Dünyasından. Merak Etmiyor musun?<br><b>Bir Hacker'ın Gözüyle Saldırı Senaryoları Sistem Açıkları ve Korunma Yöntemleri</b><br>Okuyacağınız bu kitapta bir saldırganın hedeflediği sisteme sızma göçertme çıkar elde etme yolunda kullanacağı yöntemler ve bunlara karşı alabileceğiniz güvenlik önlemleri titiz bir şekilde belirli bir sıra ve düzen dahilinde konu olarak ele alınmıştır. Belirtmek isterim ki bu metotlar saldırgan adaylarına ışık tutmak için değil düşmanı düşmanın silahıyla vurmanızı sağlamak için yazılmıştır...<br><br>Kitabın program tanıtımları yapılarak veya sayfalarca uygulama kaynak kodları verilerek özen gösterilmiş içeriğin özgün olması için açık ve hataların oluşma sebepleri ve saldırıların çalışma prensipleri anlatılmıştır.<br><br>Her yazılımcının ağ uzmanının sistem yöneticisinin ve bilgisayar kullanıcısının büyük kayıplar vermeden önce okuması gereken bir kitap.<br><br><b>HACKING INTERFACE </b><br>İnternet'in yeraltı dünyasını merak etmiyor musunuz Bilişimin karanlık dünyasında hedef sistemlere sızmak için yapılan tüm saldırıları ve korunma yöntemlerini öğrenmek istiyorsanız bu kitap tam size göre.<br><br>Günümüz dünyasının en az reel hayatı kadar önemli olan sanal dünyası teknolojik ilerlemeyle birlikte birçok güvenlik tehdidini de beraberinde getirmiştir. Kurumsal işlevli e posta adresleri çalınıyor online alışverişte kullanılan kredi kartı bilgileri ele geçiriliyor kritik bilgilere sahip ağlar izleniyor. Sistemlere karşı yapılan saldırı metotlarının birçoğu bilinmesine rağmen neden karşı konulmaz bir şekilde saldırılar hala devam ediyor Kullanılan güvenlik duvarları saldırı tespit önleme sistemleri ve yazılımlar... Hiç biri güvenliğin sağlanması için yeterli olmuyor. O halde eksik olan nedir merak ettiniz mi?<br><br>Bu kitapta sisteminize gelebilecek saldırılar bir Güvenlik Uzmanı gözüyle değil bir Hacker'ın gözüyle incelenmiştir. Hedeflenen sisteme saldırı öncesi bilgi toplama aşamasından saldırı sonrası kayıtları silmeye kadar olası senaryoları ve ihtimalleri bir bütün olarak ele alınıp geliştirilebilecek güvenlik çözümleri sunulmuştur. Konuların anlatımında yalın bir dil tercih edilmiş ve en temel seviyeden en profesyonele kadar her kesime hitap etmesine özen gösterilmiştir.<br><br><br><br><b>Sayfa Sayısı: </b>272<br><br><b>Baskı Yılı: </b>2016<br><br><br><b>Dili: </b>Türkçe<br><b>Yayınevi: </b>Kodlab</p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n               <strong>\n                   Güzel\n               </strong>\n               <p>Kitabın anlatım dili başlangıç seviyesindeki okurlar için gayet anlaşılır ve bilgiler oldukça öz biçimde aktarılmış.</p>\n           </div>", "detail": "<div class=\"comment-details\">\n               <p>08.06.2014</p>\n           </div>"}]},
{"product_name": "Örneklerle Algoritma ve C# Programlama", "author": "Erhan Arı", "publisher": "Seçkin Yayıncılık", "content": "<p><br>Gördüğü yoğun ilgi sonucunda, gözden geçirilmiş 3. baskısını yapan kitap programlamaya yeni başlayanları da kapsayacak şekilde, programlama ile ilgilenen, günümüzün tercih edilen ve yaygın olarak kullanılan programlama dillerinden biri olan C# dilini öğrenmek isteyen, Bilgisayar Programlama dersini alan tüm eğitim kurumları öğrencilerine yönelik sade ve anlaşılır bir dille yazılmıştır. Kitabı bitirdiğinizde, programlama mantığını ve C# programlama dilini öğrenebileceksiniz.<br><br>Kitap içerisinde temel kavramlar, algoritmalar, akış diyagramları, C# Konuları ve C# ile gerçekleştirilmiş örnekler yer almaktadır. Ayrıca C# diline ait komut ve ifadelerin daha iyi kavranabilmesi için programın kullanılışları uygulamalı olarak anlatılmıştır. Tüm konularda kolaydan zora doğru analiz edilerek çözülmüş örneklere ve konu içlerinde konuların daha iyi kavranabilmesi için çalışma sorularına ve 115'i çözümlü 168 Örnek Çalışmaya yer verilmiş ayrıca tüm sorularda akış diyagramları oluşturularak programlama mantığının öğrenilmesi amaçlanmıştır. Örnek çalışmalar C# derleyicisi tarafından derlenmiş olup, ekran çıktılarına kitap içerisinde yer verilmiştir.<br><br>Eser, üniversitelerde okutulmakta olan temel seviyedeki \"Temel Programlama, Algoritmalar\" derslerine uygun olarak hazırlanmış ve de algoritmalar ve C# dilini kendi kendine öğrenmek isteyenlere de hitap etmektedir.<br><br>Kitapta Bulunan Konu Başlıkları<br>Akış Diyagramları<br>Değişkenler ve Veri Türleri<br>Tür Dönüşümleri<br>C# Programlama Dilinde Operatörler<br>Kontrol Deyimleri<br>Döngü Deyimleri<br>Metotlar<br>Programlama Hataları<br>Dosyalama İşlemleri<br>Veritabanı İşlemleri<br>C# Uygulama Örnekleri<br>(Tanıtım Bülteninden)<br><br><br><br><b>Sayfa Sayısı: </b>328<br><br><b>Baskı Yılı: </b>2016<br><br><br><b>Dili: </b>Türkçe<br><b>Yayınevi: </b>Seçkin Yayıncılık</p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n                <p>Henüz yorum yapılmadı!</p>\n            </div>", "detail": null}]},
{"product_name": "Python 3", "author": "Timur Karaçay", "publisher": "Seçkin Yayıncılık", "content": "<p><br>Python'a giriş niteliğinde olan bu kitap, hiç programlama bilmeyenlere programlamanın temellerini ve Python'u öğretmek amacıyla yazılmıştır. Sisteminize Python'u nasıl yükleyeceğinizden başlayarak, Python araçlarını tanıtan kitap, 100'den fazla örnek uygulama ve 150'den fazla program ile konuları akıcı bir üslup ve pedagojik yöntemlerle anlatmaktadır.<br><br>Python etkileşimli, yorumlayıcı ve nesne tabanlı bir dildir. Javascript, VBasic, PHP, ASP, JSP gibi script dillerinin bütün hünerlerine fazlasıyla sahiptir. Onu web uygulamalarınızda bir script dili olarak kullanabilirsiniz. Python nesne tabanlı bir dildir. Python'da her şey nesnedir. Nesne tabanlı programlamanın bütün hünerlerini onda görebilirsiniz.<br><br>Otuzdan çok kitaba imza atmış olma yanında TDK ve TÜBA'nın bilimsel terim üretme çalışmalarına etkin olarak katılan yazar, bu kitapta da Türkçe bilim terimlerini kullanmaya özen göstermiştir.<br><br><b>Kitapta Bulunan Konu Başlıkları</b><br></p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n                <p>Henüz yorum yapılmadı!</p>\n            </div>", "detail": null}]},
{"product_name": "HTML5 & CSS3", "author": "Fahrettin Erdinç", "publisher": "Pusula Yayıncılık", "content": "<p><br>Fahrettin Erdinç, web tasarımına ve HTML'e yeni başlayanları hedef alarak yazdığı bu kitapta,  fazla teoriye kaçmadan, konuya odaklanarak, kolay anlaşılacak örneklerle web tasarım mantığını anlatıyor, HTML 5 ve CSS 3'ün yeni olanaklarını örneklerle okura sunuyor. <br>Kitapta Web sayfalarının oluşturulması süreci anlatılırken, Steve Champeon'ın \"Aşamalı Geliştirme\" yaklaşımını kullanıldı. Bu yaklaşımda amaç, önce basit bir sayfa oluşturup zamanla eklemeler yaparak daha karmaşık sayfalar oluşturmaktır. Bu yöntemde, önce HTML kodları yazılıyor ve okurla birlikte doğru çalışıp çalışmadığı test ediliyor. Daha sonra CCS kodları eklenip sayfa daha görsel hale getiriliyor. Son olarak da Javascript ve ilgili kütüphaneleri kullanarak daha etkileşimli sayfalar oluşturuluyor. Fahrettin Erdinç, web teknolojisinin en yeni araçlarını kullanarak, web sayfası tasarımının temel mantığını herkesin anlayabileceği bir şekilde adım adım anlatıyor. Bu da kitabı, hiç HTML ve CSS bilmeyip öğrenmek isteyen veya var olan HTML/CSS bilgisini geliştirmek isteyenler için ideal başvuru kaynağı haline getiriyor.<br>(Tanıtım Bülteninden)<br><br><br><br><b>Sayfa Sayısı: </b>280<br><br><b>Baskı Yılı: </b>2016<br><br><br><b>Dili: </b>Türkçe<br><b>Yayınevi: </b>Pusula Yayıncılık</p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n                <p>Henüz yorum yapılmadı!</p>\n            </div>", "detail": null}]},
{"product_name": "C# 6.0", "author": "Volkan Atasever", "publisher": "Level", "content": "<p><br>C# 6.0 programlama dilini baştan sona size öğreten ve uygulayan bir kitabı elinizde tutmaktasınız. Visual Studio 2015 sürümünde gelen Cross Platform desteği ile Microsoft teknolojileri daha fazla değer kazanmıştır. iOS ve Android uygulamalarını Visual Studio 2015 ile birlikte geliştirebilmektesiniz. Bu programlama dilinin yükselişini gösterirken, aynı zamanda bu programlama dilini bilerek okulunuzda veya iş yaşamınızda bir adım daha öne geçeceksiniz. C# programlama dili Nesne Yönelimli bir dil olduğu için bu kavramlar ve nasıl uygulanacağı size ayrıntılarıyla anlatılmıştır. C# programlama dilini hem görsel hem de kodsal olarak öğrenebilmeniz hedeflenmiştir. Veri tabanı programlama ile temel veritabanı işlemlerinizi gerçekleştirebilirsiniz. REST ve SOAP web servisleri bu kitapta ayrıntılarıyla ele alınmıştır. Büyük bir uygulama geliştirmek için fazla beklemenize gerek yok; hemen C# 6.0 programlama dilini öğrenerek büyük projeler içine girebilirsiniz.<br><br>-C# Nasıl Doğdu ve Nasıl Gelişti<br>- Visual Studio 2015'i İnceleme ve Tanıma<br>-Windows Form Bileşenlerini Tanıma<br>-Temel Veri Tipleri ve Değişkenler<br>-Operatörler, Döngüler ve Deyimler<br>-Diziler ve String'ler<br>-Test ve Hata Yakalama<br>-Sınıflar, Nesneler ve Metotlar<br>-Kalıtım<br>-Indeks'leyiciler ve Özellikler<br>-Interface, Structure ve Enumaration<br>-Grafik Programlama<br>-I/O (Input/Output) İşlemleri<br>-Delegeler ve Olaylar<br>-Jenerik Koleksiyonlar, StringBuilder, Regular Expression, Bellek Yönetimi<br>-Çok kanallı, Asenkron ve Paralel Programlama<br>-Internet ve Ağ Uygulamaları<br>-Veri Tabanı İşlemleri<br>-XML ve Web servisleri ile çalışmak<br>-LINQ (Language Integrated Query)<br>-Java ile C# arasındaki benzerlik<br>-TFS Kullanımı<br>-Mobil Programlama<br>-C# ile Algoritma Örnekleri<br><br>Kitaptaki konuların ana başlıkları:<br><br>1. Bölüm: C# Nasıl Doğdu ve Nasıl Gelişti?.<br>2. Bölüm: Visual Studio İnceleme ve Tanıma<br>3. Bölüm: Windows Form Bileşenlerini Tanıma ve Kullanma<br>4. Bölüm: Temel Veri Tipleri ve Değişkenler<br>5. Bölüm: Operatörler, Döngüler ve Deyimler<br>6. Bölüm: Diziler ve String'ler<br>7. Bölüm: Test ve Hata Yakalama<br>8. Bölüm: Sınıflar, Nesneler ve Metotlar<br>9. Bölüm: Kalıtım<br>10. Bölüm: Indeksleyiciler ve Özellikler.<br>11. Bölüm: Interface, Structure ve Enumaration<br>12. Bölüm: Grafik Programlama<br>13. Bölüm: I/O (Input/Output) İşlemleri<br>14. Bölüm: Delegeler ve Olaylar<br>15. Bölüm: Jenerik Koleksiyonlar, StringBuilder, Regular Expression, Bellek Yönetimi<br>16. Bölüm: Çok Kanallı, Asenkron ve Paralel Programlama<br>17. Bölüm: Internet ve Ağ Uygulamaları<br>18. Bölüm: XML ve Web Servisleri ile Çalışmak<br>19. Bölüm: LINQ (Language Integrated Query)<br>20. Bölüm: Java ile C# Arasındaki Benzerlik.<br>21. Bölüm: C# ile iOS ve Android Uygulamaları Geliştirme<br>(Tanıtım Bülteninden)<br><br><br><br><b>Sayfa Sayısı: </b>526<br><br><b>Baskı Yılı: </b>2015<br><br><br><b>Dili: </b>Türkçe<br><b>Yayınevi: </b>Level</p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n               <strong>\n                   İçerik\n               </strong>\n               <p>Merhaba, kitabı aldım. Google Translate ile çevrilmiş gibi, devrik cümleler, anlaşılmaz örnekler, çok pişman oldum aldığıma.</p>\n           </div>", "detail": "<div class=\"comment-details\">\n               <p>20.10.2016</p>\n           </div>"}]},
{"product_name": "Arduino", "author": "Coşkun Taşdemir", "publisher": "Dikeyeksen", "content": "<p><br>İleri seviyede elektronik ve yazılım bilgisine sahip olmayan kişilerin de kolaylıkla interaktif projeler oluşturmasını sağlamak amacıyla tasarlanmış olan Arduino bugün dünyanın en popüler açık kaynak donanım projelerinden birisi haline gelmiş durumdadır. Bu kitapla Arduino ile tanışarak interaktif elektronik projeleri nasıl gerçekleştirebileceğinizi öğreneceksiniz. Yapabileceklerinizin hayal gücünüzle sınırlı olduğu Arduino dünyasına hoşgeldiniz!<br><br>İnsansız hava araçları alanında ar-ge mühendisliği yapmış, milli insansız araç projelerinde yer almış ve halen Siemens'de ar-ge mühendisi olarak çalışan Elektronik Mühendisi Coşkun Taşdemir'in sade ve anlaşılır anlatımıyla Arduino'da sağlam adımlarla ilerleyeceksiniz. Kitapta anlatılan konuların başlıcaları şöyle:<br><br></p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n               <strong>\n                   Kitap Güzel\n               </strong>\n               <p>Özellikle mikrodenetleyici dünyasına giriyorsanız ve elinizde Serdar Çiçek'in PIC Programlama kitabı yoksa bu kitap bence ideal.</p>\n           </div>", "detail": "<div class=\"comment-details\">\n               <p>04.05.2014</p>\n           </div>"}, {"content": "<div class=\"comment-content\">\n               <strong>\n                   bu kitapda bazı eksiklikler var\n               </strong>\n               <p>Kitap hiç elektronik bilgisi olmayan biri için bulunmaz bir nimet fakat içeriginde interrup kesmeleri (timer kesmeleri hariçi giriş kesmeleri rs232 kesmeleri i2c kesmeleri vb.) eksik. Uygulamamarda bütün  çıkış portlarına veriler bit bazında verilmiş (örnegin 7 segment gösterge uygulaması displayde 8 verisini yakmak için 7 tane komut kullanılmış 0xff verisinin bir porta nasıl gönderileceği yok )<br>kitapda micro c veya ccs c programlama dilerini bilen biri için çok az yeni öğreneceği bilgi var.</p>\n           </div>", "detail": "<div class=\"comment-details\">\n               <p>21.09.2012</p>\n           </div>"}]},
{"product_name": "Veri Madenciliği Yöntemleri", "author": "Yalçın Özkan", "publisher": "Papatya Bilim", "content": "<p><br>Bu kitap, veri madenciliği yöntemlerini ele alan temel ve nitelikli bir eserdir. Sınıflama, kümeleme ve birliktelik kurallarıyla ilgili birçok algoritma en yalın biçimiyle incelenmiştir.<br><br>Veri madenciliği, kurumların zaman içerisinde sahip olduğu büyük boyutlardaki verilerden alışılagelen istatistik yöntemlerle elde edilemeyen veya elde edilmesi güç olan bilgileri elde etmek için bir çeşit verileri işleme ve çözümleme yöntemidir. Yani sahip olduğumuz veri kümesinden işimize yarayacak yararlı bilgiyi üretme yöntemidir.<br><br>\"Veri Madenciliği\" adlı bu kitabımızda sırasıyla veri ambarı kavramı, veri madenciliği kavramı ve kullanım alanları, veri madenciliğinde kullanılan sınıflandırma algoritmaları, Twoing ve Gini algoritmaları, en yakın k-komşu algoritması, kümeleme konusu, hiyerarşik ve hiyerarşik olmayan kümeleme biçimi,  sepet çözümlemeleri adıyla bilinen birliktelik kuralları, \"Bayes ağları\" ve \"Destek Vektör Makineleri\" konusu ele alınmıştır; herbiri bir bölüm olarak düzenlenmiştir.<br><br>Böylesi bir \"Veri Madenciliği\" kitabı hem profesyoneller için yararlı bir başvuru kitabı hem de bilgisayar mühendisliği, matematik-bilgisayar, yönetim bilişim sistemleri, endüstri mühendisliği, yazılım mühendisliği gibi mühendislik ve sosyal bilimlerde dört yıllık lisans ve meslek yüksek okulu öğrencileri için yararlı bir ders kitabı özelliğindedir.<br>(Tanıtım Bülteninden)<br><br><br><br><b>Sayfa Sayısı: </b>240<br><br><b>Baskı Yılı: </b>2016<br><br><br><b>Dili: </b>Türkçe<br><b>Yayınevi: </b>Papatya Bilim</p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n                <p>Henüz yorum yapılmadı!</p>\n            </div>", "detail": null}]},
{"product_name": "Yeni Başlayanlar İçin Arduino", "author": "Fahrettin Erdinç", "publisher": "Pusula Yayıncılık", "content": "<p><br>Arduino ile kendi robotunuzu ve entegre sistemlerinizi geliştirin! İhtiyacınız olan iki şey var: Arduino seti ve bu kitap...<br><br>Son yıllarda en popüler açık kaynak kodlu geliştirme platformu haline gelen Arduino'yu Fahrettin Erdinç herkesin anlayabileceği bir şekilde ele alıyor. <br><br>Açık kaynak kodlu yazılımların donanımdaki bir karşılığı olan Arduino, benzerleri gibi, belirli kişiler veya kurumlar tarafından tasarlanarak üretilen, devre şemaları herkese açık olan ve diğer kişiler tarafından da üretilebilen donanımlar içerir. Arduino tek bir donanım olmayıp, bir geliştirme platformudur, başarısının arkasında yatan en önemli etken de açık kaynak kodlu oluşudur.. Arduino'nun popülerliğini sağlayan en önemli şey, mikro denetleyiciler konusunda çok fazla şey bilmeyen kullanıcıların da Arduino kütüphanelerini kullanarak rahatlıkla proje geliştirebilmeleridir.<br><br>Bu kitap, size Arduino ile yapabileceklerinizi en başından adım adım gösterecek. Öncelikle programlama konusunda bilgi sahibi olmalısınız. Bu nedenle de kitabın başlangıç bölümleri programlamanın temellerine ayrılmıştır.  Arduino ile uygulamalar yapabilmek için, programlamanın dışında temel elektronik bilgilerine de sahip olmanız gerekiyor. Kitabın ileriki bölümlerinde, temel elektronik bilgilerinin yanı sıra, donanıma ve mikro denetleyicilere yönelik somut uygulamalar yer alıyor: Analog ve dijital sinyaller nasıl alınır, nasıl işlenebilir? Sensörlerden gelen sinyaller nasıl kullanılır? Çevresiyle iletişime geçebilen düzenekler ve basit robotlar nasıl yapılabilir? Arduino ile bilgisayarınızı nasıl dış ortamla etkileşebilir hale getirebilirsiniz?<br>(Tanıtım Bülteninden)<br><br><br><br><b>Sayfa Sayısı: </b>436<br><br><b>Baskı Yılı: </b>2016<br><br><br><b>Dili: </b>Türkçe<br><b>Yayınevi: </b>Pusula Yayıncılık</p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n                <p>Henüz yorum yapılmadı!</p>\n            </div>", "detail": null}]},
{"product_name": "SQL Server 2016", "author": "İsmail Adar", "publisher": "Abaküs Kitap", "content": "<p><br>Veri Tabanı Yönetimi için Temel Başvuru Kaynağı!<br>5 Saati Aşkın Video Eğitimiyle Birlikte<br><br>Dünyanın en yaygın kullanılan veri platformu SQL Server'ın son sürümü Microsoft SQL Server 2016 ile artan veri hacminin getirdiği zorlukların üstesinden gelerek boyutu ve formatı ne olursa olsun verilerin hızla yararlanılabilir iş bilgilerine dönüştürülmesine olanak sağlıyor. Birçok firma tarafından tercih edilen Microsoft SQL Server'ın bir kurumun tüm ihtiyaçlarına cevap verebilecek bir veritabanı yönetim sistemi olmasıyla bu yöndeki uzman personel ihtiyacı da aynı oranda artmıştır. Günümüzde hâlâ çok popüler olan Veritabanı Yöneticiliğine ilk adımı atmak için elinizdeki bu kitap size hem Microsoft SQL Server ile veritabanı üzerinde sorgulama yapmak hem de geliştirdiğiniz uygulamalarda kullanabileceğiniz ileri seviye TSQL yetkinliği kazanma imkânı sunuyor.<br><br>Microsoft SQL Server 2016 ile ilgili olarak yazılan ilk Türkçe kitap olma niteliğini taşıyan bu kitabın temel amacı bilişim teknolojileri alanında büyük bir eksiklik olan Türkçe kaynak ihtiyacını bir nebze de olsa azaltabilmektir.<br><br>Elinizdeki bu kitap Microsoft SQL Server 2016 için bir referans kitabı olmanın ötesinde SQL Server 2016'yı kurmak, etkin bir şekilde kullanmak ve SQL Server 2016'yı kullanarak veritabanı çözümleri ve programlaması yapmayı özgün senaryo ve örneklerle ele alan bir kitaptır. Ayrıca bu kitap daha önceden hiç SQL Server bilgisi olmasa bile temel düzeyde sistem veya yazılım bilgisi olan ve SQL Server öğrenmek isteyen veya var olan SQL Server bilgisini üst noktalara taşımayı amaçlayan kişilere hitap etmektedir.<br><br></p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n                <p>Henüz yorum yapılmadı!</p>\n            </div>", "detail": null}]},
{"product_name": "Uygulamalarla Siber Güvenliğe Giriş", "author": "M. Alparslan Akyıldız", "publisher": "Gazi Kitabevi", "content": "<p><br><b>İçindekiler</b><br><br>1-Lab İçin Sanal Makina Kurulumu<br>2-Lınux İşletim Sistemine Giriş<br>3-Temel Network Kavramları<br>4-Hedefe Yönelik Bilgi Toplama Ve Zafiyet Analizi<br>5-Reverse Shell Ve Bınd Shell Kavramları<br>6-Explotatıon<br>7-Bufffer Overflow Ve Exploit Geliştirmeye Giriş<br>8-Yerel Ağ Güvenlik Testleri<br>9-Dosya Aktarımları Ve Tünelleme Teknikleri<br>10-Parola Atakları<br>11-Dos (Denail Of Service )Servis Dışı Bırakma Saldırı Testleri<br>12-Kablosuz Ağlara Yönelik Yapılan Güvenlik Testleri<br>13-Web Açıklıkları Ve Tes Etme Yöntemleri<br>14-Voıp Ağlarda Güvenlik Test Uygulamaları <br>15-Sosyal Mühendislik<br>16-Puvotıng<br>17-Ctf Ve Çözümleri<br>18-Pentest Raporu Nasıl Yazılır<br> (Tanıtım Bülteninden)<br><br><br><br><b>Sayfa Sayısı: </b>585<br><br><b>Baskı Yılı: </b>2016<br><br><br><b>Dili: </b>Türkçe<br><b>Yayınevi: </b>Gazi Kitabevi</p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n                <p>Henüz yorum yapılmadı!</p>\n            </div>", "detail": null}]},
{"product_name": "Linux Komut Satırı", "author": "Kemal Demirez", "publisher": "Abaküs Kitap", "content": "<p><br><b>Linux'cunun Alet Çantası!</b><br>Linux işletim sistemini öğrenmek isteyenler ya da bu sistem hakkında bilgisi olup da tecrübesini artırmak isteyen kişilerin en önemli sıkıntısı derli toplu bir kaynak bulabilmektir. Elbette internet üzerinde ya da basılı olarak birçok kaynak bulabilirler fakat güncel ve sade bir anlatımı olan bir başvuru kaynağı her zaman bulunamayabiliyor.<br><br>Bu kitap bu alandaki açığı kapatmak ve kullanıcıların ihtiyacını karşılamak adına hazırlandı. Kitapta olabildiğince sade ve net bir anlatımı tercih edildi. Daha çok Linux komut satırı, dolayısıyla Linux komutlarının kullanımını örneklendirmeye ve en işe yarar komutlar anlatılmaya çalışıldı. Linux işletim sistemini etkin kullanmak ve ayrıca siber güvenlik alanında ilerlemek isteyen kişilerin de Linux bilgisini pekiştirmek için bu eserin yardımcı olacağı inancındayız.<br><br>Kitapta Kali Linux dağıtımının kullanılması beni ilk cezbeden nokta oldu. Konu zenginliği ve sade-anlaşılır bir anlatım olmuş. \"Herkes için\" ifadesi bu kitap için tam yerinde olacaktır. <br>-İsmail Saygılı, Bilgi Güvenliği Uzmanı-<br><br>\"Ülkemizdeki en büyük Türkçe kaynak eksikliklerinden biri tartışmasız Türkçe Linux kaynağıdır. Linux, birçok altyapı ve bütünleşik mimarinin bel kemiğini oluşturmasına rağmen kaynakların bu denli az oluşu, bu sistemleri doğru bir şekilde yönetemiyor olmamızın temel nedenini oluşturmaktadır. Kemal Hoca, bu eksikliği fark etmiş ve pratik yönelimli güzel bir kaynak hazırlamış. Gerek siber güvenlik gerekse de sistem uzmanlığı alanlarında çalışmak isteyen veya kendini bu alanlarda geliştirmek isteyen arkadaşlar için sürekli çantalarında bulunması gereken bir kaynak...\" <br>-Eyüp Çelik, Siber Güvenlik Birim Yöneticisi&amp;Siber Güvenlik Danışmanı, Cyber Security Delivery Manager&amp;Cyber Security Consultant-<br><br>Bash ve Linux Komut Satırı<br>Düzenli İfadeler<br> (Regular Expressions)<br>Sed ve Awk<br>Vim Editör<br>Network Komutları<br>SSH Servisi<br>WGET ile Dosya İndirme<br>Zamanlanmış Görevler<br>LOG Dosyaları<br>Dosya İşlemleri<br>Disk İşlemleri<br><br><br><br><b>Sayfa Sayısı: </b>256<br><br><b>Baskı Yılı: </b>2016<br><br><br><b>Dili: </b>Türkçe<br><b>Yayınevi: </b>Abaküs Kitap</p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n                <p>Henüz yorum yapılmadı!</p>\n            </div>", "detail": null}]},
{"product_name": "Uygulamalarla Unity 3D ile Oyun Geliştirme", "author": "Mehmet Ünsal", "publisher": "Abaküs Kitap", "content": "<p><br>Bilgisayar için bir oyun geliştirmek herkesin hayallerini süsler ve bilgisayarla tanışan herkes ilk başta bilgisayarın bir oyun makinası olduğunu ve iş için kullanılmasının anlamsız olduğunu düşünür. Bu düşünce oynadığı oyunların zevkiyle birleşir ve bu oyunlar nasıl yapılıyor, ben de yapabilir miyim araştırmasına sokar. Günümüz internetinde birçok oyun geliştirme sitesi var ve bu sitelerde birçok kişi her gün bu yeni hevesin sorularıyla geziniyor. Kiminin hevesi kırılıyor kimi yanlış başlangıç yapıyor kimi de eksik kaynak nedeniyle bu hevesini kaybediyor. Bizim kitabımız bu hevesinizi daha da güçlendirip size birçok seçenek sunacak.<br><br>Bu kitapta, oyun geliştirmek için bilmeniz gereken her şey detaylarıyla ele alınarak, adım adım bir oyun projesi geliştirilmiştir. Kitapta oyun geliştirmeye yeni başlayanlar da düşünülerek işe en başından başlanılmış; oyun tarihi, oyun için senaryo nasıl yazılır, oyun sahne ve karakterleri senaryoda nasıl anlatılır, storyboard nasıl hazırlanır, yazdığımız tüm her şeyi nasıl üç boyutlu bir hale getirebiliriz, bu üç boyutlu objelere nasıl daha orijinal kaplama ve giydirme uygulayabiliriz, oyun için gerekli ses ve görsel efektlerin nerelerde nasıl kullanılması gerektiği ve nasıl yapıldığını, tüm aşamalarını bitirdiğimiz oyun projemizi bir oyun motoru ile nasıl oyuna dönüştüreceğimiz, tüm incelikleriyle anlatılmıştır. Üstelik sadece yazılımla değil, A'dan Z'ye tüm aşamalarıyla.<br><br>-Yaratıcı Fikir Oluşturma<br>-Oyun Görsellerinin Çizimi<br>-Senaryo<br>-Audacity Eğitimi<br>-Storyboard<br>-Ses Efektlerinin Yapımı<br>-Sahne ve Karakterlerin Oluşturulması<br>-Görsel Efektlerin Yapımı<br>-3Ds Max Eğitimi<br>-JavaScript Eğitimi<br>-3 Boyutlu Nesnelerin Tasarlanması<br>-Photoshop Eğitimi<br>-Unity 3D Eğitimi<br>(Tanıtım Bülteninden)<br><br><br><br><b>Sayfa Sayısı: </b>624<br><br><b>Baskı Yılı: </b>2015<br><br><br><b>Dili: </b>Türkçe<br><b>Yayınevi: </b>Abaküs Kitap</p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n                <p>Henüz yorum yapılmadı!</p>\n            </div>", "detail": null}]},
{"product_name": "Projelerle Arduino", "author": "Sertan Deniz Saygılı", "publisher": "Abaküs Kitap", "content": "<p><br><b>Projelerle Herkes için Arduino!</b><br>Uygulamalarla Arduino kitabı birçok sensör ve komponenti içeren uygulamaları ve üç buçuk saati aşan uygulama videolarıyla, Arduino öğrenmek isteyenler için kapsamlı bir eğitim seti. Projelerle Arduino öğrenmeniz için derin bir elektronik bilgisi gerekmiyor. Eğitim seti, herkesin kolaylıkla uygulama geliştirebileceği, interaktif projeler yapabileceği tarzda hazırlandı. <br><br>Arduino ile ilgili komutları öğretirken, teorik bilgilerin içinde boğmak yerine, doğrudan uygulamaların içinde kullanarak anlatan kitap, bu sayede sizi, kısa sürede, Arduino konusunda başlangıçtan ileri seviyelere taşıyor. Kitapta birçok sensörün dışında, sadece kendileri bile başlı başına birer kitap konusu olan RFID, C# ile Seri İletişim, Bluetooth Kontrollü ArduCar ve Engelden Kaçan Robot uygulamaları da mevcut. Kitabın ve DVD'nin içeriğinde anlatılan uygulamalar ile alakalı malzemeler robotistan.com sitesinden Arduino Proje Seti başlığı altında görülebilir.<br><br><b>Kitap İçeriği;</b><br>Breadboard Kullanımı<br>Kızılötesi Sensör<br>Joystick Uygulaması<br>Park Sensörü<br>LCD Ekran Uygulaması<br>RFID Uygulaması<br>Hareket Sensörü<br>C# ile Seri İletişim<br>Engelden Kaçan Robot<br>Bluetooth Kontrollü ArduCar<br>Arduino Phone<br><br><b>Eğitim Videoları İçeriği;</b><br>8x8 Matris Uygulaması<br>Arduino ile Led Yakma<br>Ateş Algılayıcı Sensör Uygulaması<br>Butondan Değer Okuma<br>Buzzer<br>C# ile Seri İletişim<br>DHT11 Uygulaması<br>Engelden Kaçan Robot<br>Gaz Sensörü<br>Hareket Sensörü Uygulaması<br>HC-SR04<br>Joystick Uygulaması<br>Karanlıkta Yanan Led Uygulaması<br>Kızılötesi Sensör Uygulaması<br>LCD Ekran<br>Mikrofon Uygulaması<br>Park Sensörü<br>RFID Uygulaması<br>RGB Led Uygulaması<br>Röle Uygulaması<br>RTC Uygulaması<br>Servo Motor Uygulaması<br>Su Seviyesi / Yağmur Sensörü Uygulaması<br>Arducar<br>7 Segment Ekran<br><br><br><br><b>Sayfa Sayısı: </b>184<br><br><b>Baskı Yılı: </b>2016<br><br><br><b>Dili: </b>Türkçe<br><b>Yayınevi: </b>Abaküs Kitap</p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n               <strong>\n                   Yeni Başlayanlar İçin\n               </strong>\n               <p>Yeni başlayacak arkadaşlar için tavsiyemdir. Kolay, basit ve anlaşılır bir kitap çekinmeden alın. (Bu arada sakın CD içerisindeki kodları kopyala yapıştır yapıp kolaya kaçmayın. :))</p>\n           </div>", "detail": "<div class=\"comment-details\">\n               <p>26.04.2016</p>\n           </div>"}]},
{"product_name": "Web Tasarımı ve Web Programlama - A'dan Z'ye Yeni Nesil Tekniklerle", "author": "Uğur Gelişken", "publisher": "Level", "content": "<p><br>Zamanınızı ve Emeğinizi; Modası Geçmiş Bilgilerle Boşa Harcamayın. Yeni Nesil Tekniklerle Web Tasarımı ve Web Programlama Öğrenin!<br><br>Kitap, genel amacı ile size web tasarımı ve web programlama konusunda bilmeniz gereken hemen hemen her şeyi sizlere pratik örneklerle, sektörde kullanılan tekniklere dayalı olarak uygulamalı bir şekilde anlatmaktadır. <br><br>Günümüz, internet çağı, artık her bir bilgiye istediğimiz zaman anında ulaşabiliyoruz. Evet, istediğimiz her bilgiye anında ulaşıyoruz; ama bu bilgilerin ne kadarı işe yarar bilgi, ne kadarı güncel, ne kadarı da anlaşılabilir halde... Eğer yeni başlayan biriyseniz; bir konuyu öğrenmek için araştırma yaptığınızda onlarca sayfa içinde, aradığınız bilgilere ulaşmak isterken kaybolmanız ihtimal dâhilindedir. Yine neyi öğreneceğinizi bilmeniz de size çok fazla vakit kaybettirecektir. Çünkü öğrenmeye yeni başlayan insanlar, bir anda her şeyi öğrenmeye çalışıp çoğunlukla da bilgi yoğunluğuna maruz kaldığı için, o anlık öğrendiği bilgiler zihinlerinde kalıcı olmaz. Yine öğrenmiş olduklarının da çoğunun aslında sektörde daha kullanılmadığını fark ettiklerinde, kaybetmiş oldukları zaman ve emek için üzüntü duyacaklardır. Bu nedenle size doğru öğrenme metotları ile doğru teknolojileri uygulamalarla öğrenmenizde yardımcı olacağım. Yine kitap boyunca sizi gereksiz metinler ve sırf kitabı doldurmak için yazılmış olan çöp yazılarla sıkmayacağım. Direkt konuya gireceğiz ve ilk sayfalardan itibaren somut olarak işe yarar bir şeyler öğrenmeye başlayacaksınız. Yeri geldikçe de dipnotlarla ekstra bilgiler verip konuyu daha iyi kavramanızı sağlayacağım.<br><br>Özet olarak kitabın akışı şu şekilde olacaktır:<br>Kitaba başlarken ilk olarak yeni tasarım ve programlama trendlerini göz önünde bulundurarak, HTML5 dilini Semantik Web temelleri ile öğreneceksiniz. Sonrasında ise CSS3, SASS ve SCSS ile yeni nesil metotlar kullanarak içerikleri biçimlendirmeyi göreceksiniz. Ardından JavaScript (EcmaScript 5) dilini genel anlamı ile kullanmayı, OOP yaklaşımı ile de kodlamayı öğreneceksiniz. Buraya kadar web önyüz programlamanın 3 temel bacağını rahatlıkla kontrol edebiliyor olacaksınız.<br><br>Ardından ikinci aşamaya geçilecek. Mobil ve Responsive kavramları ile Bootstrap CSS Framework'ünü kullanarak daha pratik ve daha etkili bir şekilde arayüz tasarımını öğreneceksiniz. Web sayfalarınızda biraz dinamiklik katmak için de VelocityJS ve AniJS Framework'lerini de öğrenip, web bileşenlerinize canlılık katacaksınız.<br><br>Web arayüz programlamada MVVM mimarisini ele alacağız. Günümüzde en çok kullanılan JavaScript Framework'ü olan AngularJS ile MVVM modelini kullanarak daha güçlü web sayfaları programlamayı bolca örneklerle öğreneceksiniz. <br><br>Üçüncü aşamada ise sunucu programlama ve veritabanı yönetimine geçeceğiz. Sunucu programlama dili olarak PHP'yi genel olarak öğreneceksiniz. PHP'de OOP yaklaşımını da kavradıktan sonra MySQLi ile veritabanı yönetimini SQL sorguları ile yine bol bol pratik yaparak somut örneklerle öğreneceksiniz. <br><br>Temel olarak web tasarımı, web önyüz ve arkayüz programlamayı öğrendiğiniz bu aşamada, SEO konusunu ele alacak ve SEO yaklaşımı ile nasıl programlama yapmanız gerektiğini örneklerle göreceksiniz. <br><br>Artık bilgileriniz pekiştirmek için baştan sona Mobil Web Sitesi projesi hazırlayacağız. Bu projede HTML5, Bootstrap, AngularJS, PHP ve MySQLi kullanacağız. Hazırladığımız web sayfası için bir de CMS, yani İçerik Yönetim Sistemi kodlayacağız. <br><br>Son olarak HTML5 Canvas ile PhaserJS framework'ünü kullanarak adım adım bir platform oyunu kodlayacağız. Ek olarak ActionScript 3.0 geliştiricilerini de unutmayarak, Adobe Flash CC ile ActionScript 3.0 kullanarak HTML5 Canvas ve WebGL platformu için nasıl uygulama ve animasyon geliştireceklerini de örneklerle inceleyeceğiz.<br><br>Kitapta yer alan ana başlıklar şunlardır:<br></p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n               <strong>\n                   Dolu Dolu\n               </strong>\n               <p>Kitabın bültenini okumak bile insanı bilgilendirmeye yetiyor. Ve kitabı aldığında da bunların hepsini öğreneceğini bilmek insanı heyecanlandırıyor. İçerik gerçekten de güncel yapılar ile anlatılmış. bir Web tasarımcısının veya arkaplan kod geliştiricisinin bilmesi gereken konuların hepsi ve daha fazlası uygulamalar ile anlatılmış. Kitabın yanında verilen eğitim setleri de bonus etkisi yapıyor. Herkese tavsiye edebileceğim bir kitap.</p>\n           </div>", "detail": "<div class=\"comment-details\">\n               <p>28.04.2016</p>\n           </div>"}, {"content": "<div class=\"comment-content\">\n               <strong>\n                   Güncel ve Başarılı Bir Çalışma\n               </strong>\n               <p>Önceki kitabınızı da okumuştum, çok faydalı olmuştu bunun da çok iyi olduğuna eminim.</p>\n           </div>", "detail": "<div class=\"comment-details\">\n               <p>23.04.2016</p>\n           </div>"}]},
{"product_name": "Jquery", "author": "Salih Baltalı", "publisher": "Kodlab", "content": "<p><br>Bu kitapta akıcı, anlaşılır bir dil kullanmaya çalışılmıştır. Konuyu dağıtmadan meseleyi, az ve öz anlatılmıştır. Kitap içerisinde 3 ana bölüm bulunmaktadır. 600’den fazla ufak örnek, 50 adet uygulamalı örnek sunulmuştur. jQuery kütüphanesinde JavaScript komutları oldukça fazla ve ayrıca programlama mantığını da bilmek gerektiğinden JavaScript konusunu 2. bölümde anlatılmıştır. Buna ek olarak amaç web siteleri veya görsel sistemler tasarlamak olduğundan hareketle CSS konusunun da bilgi sahibi olunması gerekmektedir. Bu yüzden 1. bölümde de CSS konusu anlatılmıştır. jQuery’de metotların pekiştirilmesi için CSS ve JavaScript konuları da değinilmiştir. Konuları sırası ile sabırla uygulama yaparak çalışırsanız kitabı bitirdiğinizde web tasarımında yeni bir yetenek kazanmış olacaksınız. Web sitesi tasarlamaya yeni başlayan ve mevcut siteleri geliştiren kişilerin bilmesi gereken konular bu kitapta etraflıca anlatılmıştır. Zaten anlatılan 3 ana bölüm altındaki konular ile bir web sitesinde yapılması gerekenleri barındırmaktadır. Asgari olarak bilinmesi gerekenler anlatılmıştır. Gerektiği yerde detaya girilmiştir. Kitapta anlatılan her metot veya fonksiyon hakkında en az bir örnek yapılmıştır. Bu örnekler bahsi geçen metodu veya fonksiyonun ne yaptığı veya nasıl çalıştığını anlatmak içindir. Ayrıca her konu sonunda daha somut ve kullanılabilir uygulamalı örnekler verilmiştir. Bu örnekler genellikle web geliştiricilerinin çokça kullandığı veya ihtiyaç duyduğu örneklerdir. Böylece jQuery dilini uygulamalı olarak etkin bir şekilde öğreneceksiniz. Kitapta Geçen Başlıklar • DOM Yapısı • Seçiciler (Selectors) • Filtreler (Filters) • Sıradışı (Traversal) Seçim Fonksiyonları • Çekirdek Yapısı (Core) • DOM Nesnelerini Manipüle Etme • Ölçü ve Pozisyon Fonksiyonları (Dimension Functions) • Olay Fonksiyonları (Event Functions) • Efektler (Effects) • AJAX Metodları • Yardımcı Metodlar • Tabloları jQuery ile Manipüle Etme • PHP, MySQL ve JSON ile Uygulama Örneği • Otomatik (Autocomplete) Tamamlama • Sekmeli (Tabs) Sayfalar • Açılır-Kapanır (Accordion) Alan Yapımı • Değişen Alan Yapımı • Dinamik Yorum Ekleme • RSS Dosyasından Veri Çekme • Datetimepicker (Takvim) Uygulaması • AJAX ile XML Dosyadan Okuma • Kayan Alan Yapımı • jQuery ile Input Giriş Değerlerini Formatlamak (Mask) • jQuery ile Sürükle-Bırak Uygulaması (Drag-Drop) Yazar Hakkında; Salih BALTALI, 1980 Sivas doğumludur. 1999’da Sivas Teknik ve Endüstri Meslek Lisesi Bilgisayar Bölümü’nden mezun olmuştur. Selçuk Üniversitesi Bilgisayar Öğretim Teknolojileri Öğretmenliği’ni 2004 yılında bitirdi. Türkiye’nin değişik yerlerinde çalıştıktan sonra halen Bursa’da görevine devam etmektedir. Bilgiyi eyleme geçirme felsefesiyle hareket edip birçok yerde kurslar açıp programlama dilleri anlatmıştır. Ayrıca değişik zamanlarda ihtiyaçlara göre programlama ve tasarım alanında görev yapmaya devam etmektedir.<br><br><br><br><b>Sayfa Sayısı: </b>410<br><br><b>Baskı Yılı: </b>2015<br><br><br><b>Dili: </b>Türkçe<br><b>Yayınevi: </b>Kodlab</p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n                <p>Henüz yorum yapılmadı!</p>\n            </div>", "detail": null}]},
{"product_name": "Bootstrap 4", "author": "Uğur Gelişken", "publisher": "Level", "content": "<p><br>\"İlk Önce Mobil\" sloganı ile üretilmiş olan JavaScript ve CSS birleşimi olan melez bir Framework olan Bootstrap, günümüzde neredeyse yeni nesil bütün web sayfalarının tasarımlarında ve hybrid olarak üretilen mobil uygulamaların arayüz tasarımında, geliştiricilerinin de iş yükünü hafifletmektedir.<br><br>Kitap, Bootstap v4 sürümünü bütün yönleriyle uygulamalı olarak ele almıştır. Genel olarak tipografi, grid sistemi, bileşenler, bileşenlerin jQuery ile kullanımı, CSS ile ortak kullanımları ve daha birçok özellik uygulamalı olarak işlenmiştir. Ayrıca, yeni nesil Frond-end Toolkit'ler dediğimiz Node.js tabanlı çalışan npm paket yöneticisi ve Grunt görev yöneticisi de uygulamalı olarak ele alınmış, şu an sektörde en çok ihtiyaç duyacağınız uygulama örnekleri (proje oluşturma, sürüm notları, dosya değişikliği izleme, real-time yansıtma, yedekleme, SASS derleme, HTML, JS ve CSS dosyalarını minimize etme, dosya birleştirme gibi) de video destekli olarak anlatılmıştır. Kitapta edineceğiniz bilgilerle, responsive (duyarlı) web arayüzü geliştirme kendinizi geliştirmiş olacaksınız.<br><br>Kitapla ile birlikte ücretsiz olarak verilen CD içerisinde, kitapta anlatılan örneklerin kaynak kodları, front-end toolkit'lerin kullanımı ile ilgili uygulama örneklerine ait eğitim videolarını ve gerekli diğer araçları bulabilirsiniz.<br><br>Genel olarak kitaptaki ana başlıklar şunlardır:<br><br>-A'dan Z'ye Bootstrap 4<br>-Bootstap'a Giriş ve Temel Kavramlar<br>-Responsive ve Adaptive Kavramları<br>-Sublime Text ile Kodlama <br>-Responsive Tasarım Test Araçları <br>-Bootstrap 4 ile Gelen Yenilikler ve Geride Bırakılanlar<br>-Grid (Izgara) ve Media Object (Medya Nesnesi) Düzen Sistemi<br>-Bootstrap CSS (Tipografik Stiller)<br>-Bootstrap Components (Bileşenler) ve jQuery Plug-in'leri<br>-jQuery ile Bootstrap Bileşenlerini Kontrol Etme<br>-PHP ile Bootstrap Navbar Kullanımı<br>-Yazdırma İşleminde Gösterilecek Alanları Belirleme ve Yazdırma için Sade Stil Verme<br>-@media Sorgularına Göre Stil Değiştirme ve DOM Gizleme/Gösterme<br>-FrontEnd Toolkit'leri ile Otomasyon ve Optimizasyon Sağlama<br>-npm ile Boostrap Projesi Oluşturma<br>-Versiyonlama Mantığı ve Avantajları<br>-Grunt ile Görevleri Otomatikleştirme<br>-Paket Yapılandırması<br>-Grunt Task Tanımlama Teknikleri<br>-Uygulamalı Olarak Aşama Aşama Dosya İzleme, Real-time Yansıtma, Yedekleme, SASS'ı CSS'e Derleme, CSS/JS Birleştirme, CSS/JS/HTML Minimize Etme Grunt Task'larını Kullanma<br>(Tanıtım Bülteninden)<br><br><br><br><b>Sayfa Sayısı: </b>240<br><br><b>Baskı Yılı: </b>2016<br><br><br><b>Dili: </b>Türkçe<br><b>Yayınevi: </b>Level</p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n               <strong>\n                   Her Webmaster'ın edinmesi gereken bir kitap\n               </strong>\n               <p>Duyarlı arayüz tasarımı ve front-end araçlarının etkili bir şekilde kullanıldığı, anlatımı gayet anlaşılır ve güncel içeriklerle hazırlanmış bir kitap. Zaten yazarı Uğur Gelişken olunca bundan daha azı da beklenmezdi.</p>\n           </div>", "detail": "<div class=\"comment-details\">\n               <p>28.04.2016</p>\n           </div>"}, {"content": "<div class=\"comment-content\">\n               <strong>\n                   Uğur Bey'e teşekkürler.\n               </strong>\n               <p>Bilişim dünyasında kodlama alanında çok başarılı bir yazar Uğur Bey ve kitapları her zaman takibimde.</p>\n           </div>", "detail": "<div class=\"comment-details\">\n               <p>23.04.2016</p>\n           </div>"}]},
{"product_name": "C Programlama Dili", "author": "Rifat Çölkesen", "publisher": "Papatya Bilim", "content": "<p><br>Ülkemizde büyük kabul gören ve hemen hemen herkesin referans olarak gösterdiği bu eser \"C programlama Dili\"ni öğretmek üzere hazırlanmıştır.  Amacı, bu konuda bir standart ANSI C'yi temel alarak, günümüzdeki bütün modern programlama dillerine yol gösteren C Programlama Dili'ni öğretmek ve ciddi bir temel kazandırmaktır.<br><br>Kitapta, C Programlama Dili'nin değişkenleri, veri türleri, operatörleri, döngü deyimleri ve karşılaştırma deyimleri gibi konularda temel bilgiler verilmiş, sonra ileri düzey sayılabilecek konular ve sistem programlamada kullanılan kütüphane fonksiyonları (sistem çağrıları) da ele alınmıştır. Örneğin, ANSI C'de bulunan tüm kütüphane fonksiyonlarına ek olarak UNIX işletim sisteminin disk dosyalarında kullanılan sistem çağrıları, bir C derleyici paketinin grafik ve port erişim fonksiyonları da incelenmiştir.  <br><br>Bu kitap, \"C Programlama Dili\"ni hem öğrenmek hem de bu konuda derinlemesine bilgi edinmek isteyenlere önerilmektedir.<br><br><br><br><b>Sayfa Sayısı: </b>376<br><br><b>Baskı Yılı: </b>2015<br><br><br><b>Dili: </b>Türkçe<br><b>Yayınevi: </b>Papatya Yayıncılık</p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n                <p>Henüz yorum yapılmadı!</p>\n            </div>", "detail": null}]},
{"product_name": "Illustrator Cs6", "author": "Yavuz Gümüştepe", "publisher": "Kodlab", "content": "<p><br>Dünyada ülkelerinin yüzde 80inde Adobe Illustrator web arayüzü tasarımından illüstrasyon tasarımına masaüstü yayıncılıktan kurumsal kimlik çalışmalarına kadar birçok alanda aktif olarak kullanılıyor. <br><br>Ülkemizde birçok iş alanında da Adobe Illustrator kullanıcıları gün geçtikçe çığ gibi büyümektedir. <br><br>Bu noktadan hareketle hazırladığımız Adobe Illustrator CS6 kitabı en alt seviyeden başlanarak her kullanıcıya hitap edecek bir şekilde tasarlandı. Kitap içerisinde temel birçok konuya yer vermenin yanı sıra kitap ile birlikte edineceğiniz CD ile öğretici görsel uygulamalara da sahip olacaksınız. Bu bağlamda kitap içerisindeki konuları çalışarak ve CD içerisindeki örnek uygulamaları yaparak kolay ve zevkli bir şekilde Adobe Illustrator kullanımını öğrenebilirsiniz. <br><br>Kitap içerisinde Adobe Illustrator la ilgili temel bilgilerin yanı sıra basit ve karmaşık çizimler yapma çizimleri boyama biçimlendirme katmanlarla çalışma bitmap resimleri vektörel resimlere dönüştürme yazı ile çalışma 3 boyutlu çizimler yapma gibi birçok konu anlatılmaktadır. Ayrıca her bölümün sonunda bölüm içerisindeki bilgileri pekiştirmek için görsel uygulamalar yer almaktadır.<br><br><br><br><b>Sayfa Sayısı: </b>480<br><br><b>Baskı Yılı: </b>2015<br><br><br><b>Dili: </b>Türkçe<br><b>Yayınevi: </b>Kodlab</p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n                <p>Henüz yorum yapılmadı!</p>\n            </div>", "detail": null}]},
{"product_name": "Bilgi Güvenliği ve Hacking", "author": "Enes Aslanbakan", "publisher": "Pusula Yayıncılık", "content": "<p><br>Siber saldırılara karşı hazırlıklı olun! <br>Düşmanınızı tanıyın! <br>Hacking yöntemlerini öğrenerek sisteminizi güvende tutun...<br><br>Bugün internete bağlanmayan, dünya çapındaki ağların gölgesinde yaşamayan bilgisayar neredeyse hiç yok. İnternete ve çeşitli ağlara bağlanmanın bize sunduğu nimetler tartışılmaz: Anında bilgiye erişim, işlem kolaylığı, hayatı kolaylaştıran uygulamalar... Ama bu dünyanın bir de karanlık yüzü var: Bilgi güvenliğinizi tehdit eden, bilgisayarınıza, bağlantınıza ve verilerinize saldıran kötü niyetli kişiler! Hacker olarak adlandırılan bu kişiler çok çeşitli yöntemlerle bilgisayar ağlarının içine sızıyorlar, bilgisayar ve internet servislerinin şifrelerini kırarak başkalarının bilgilerini ele geçiriyorlar. Enes Aslanbakan, bu kitapta hacker'ların nasıl çalıştığını, bilgi güvenliğini hangi yöntemlerle tehdit ettiklerini ele alıyor ve temel hacking yöntemleri hakkında okuru bilgilendiriyor. Çünkü yöntemlerden haberdar olmak, hacker tehdidine karşı alınacak ilk ve en kritik önlem. <br><br>Bilgi Güvenliği ve Uygulamalı Hacking Yöntemleri, hacking yöntemlerini  uygulamalı olarak, çeşitli yazılımlarla anlatıyor ve hacker'ların hangi yollardan sisteminize sızabileceklerini somut olarak gösteriyor. Siber saldırılara karşı hazırlıklı olmak için benzersiz bir başvuru kaynağı...<br><br>\"Sızma testi çalışmalarına meraklı olan herkese bir yol haritası sunan bu kitap, özellikle uygulayarak öğrenmek isteyenler için adım adım ilerleme sağlayan iyi bir kaynak. Hemen her konuya ve pratikte kullanılan istismar araçlarına değinmesiyle geniş bir yelpazede öğretici olduğu gibi, adım adım siber saldırıların nasıl kolay gerçekleşebildiğini de göz önüne sererek tehdit boyutuna bir kere daha dikkat çekmemizi  sağlıyor. Sızma testleri ve zafiyet istismarı alanında kendini geliştirmek isteyenlerin veya yönettiği sistemlerin güvenliğini sağlamak için saldırganları daha yakından tanımak isteyenlerin 'Nereden başlamalıyım?' sorusuna cevap veriyor.\"<br><br>Burak ÇİFTER (Siber Güvenlik Uzmanı)<br>-Hacker'lar ve Exploit Türleri<br>-Penetrasyon Testi Nedir<br>-Vulnerability Analysis       <br>-Password Attacks<br>-Wireless Attacks <br>-Bilgi Toplama Yöntemleri        <br>-Ağ (Network) Haritalama       <br>-Yerel Ağ Saldırıları                         <br>- DNS Spoofing<br>-Parola Kırma Saldırıları<br>-FTP Servisine Yönelik Parola Saldırısı<br>-Mail Hesaplarına Yönelik Parola Saldırısı<br>-Anonim Olarak Gezinme<br>-Web Zafiyet Analizi ve Hacking Yöntemleri<br>-DDoS Saldırısı<br>-Firewall Tespiti<br>-Nessus ile Sızma Testi<br>-Exploit Edilen Cihazdan Alınabilecek Veriler ve İşlemler<br>-WPA / WPA2 Şifreli Ağlara Saldırı<br>-Gizli Kablosuz Ağların Tespiti<br>-Adli Bilişim<br>(Tanıtım Bülteninden)<br><br><br><br><b>Sayfa Sayısı: </b>148<br><br><b>Baskı Yılı: </b>2016<br><br><br><b>Dili: </b>Türkçe<br><b>Yayınevi: </b>Pusula Yayıncılık</p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n                <p>Henüz yorum yapılmadı!</p>\n            </div>", "detail": null}]},
{"product_name": "YouTube'da Zirveye Çıkma Rehberi", "author": "Abdullah Talha Karaalioğlu", "publisher": "Pusula Yayıncılık", "content": "<p><br>YouTube sizin için hâlâ eğlencelik bir araç olabilir. Ama on binlerce insan, YouTube'un sunduğu imkânları kullanarak çok değişik kampanyalar gerçekleştiriyor ve alışıldık pazarlama teknikleriyle mümkün olamayacak gelirler elde edebiliyor! Televizyon kanallarına ya da gazete ve dergi sayfalarına çıkmak hiç kolay ve ucuz bir şey değil, ama YouTube'u iyi kullanabilirseniz önünüzde kapılar sonuna kadar açılabilir ve milyonlarca insana ulaşabilirsiniz...<br><br>Abdullah Talha Karaalioğlu'nin kaleme aldığı Youtube'da Zirveye Çıkma Rehberi, sosyal medya ve dijital pazarlama alanında Türkiye'de uzun zamandır beklenen kaynak eksikliğini ortadan kaldırıyor. Başlangıç seviyesinden uzmanlık seviyesine kadar A'dan Z'ye tüm konuların işlendiği kitapta sadece Youtube platformuna bağlı kalınmamış, dolayısıyla okuyucunun aynı yöntemleri farklı dijital yayın platformlarında da uygulayabilmesi mümkün. Ayrıca kolay para kazanma yöntemleri, farklı reklam ağları ile çalışma teknikleri, dijital pazarlama stratejileri, sosyal medyayı amaca uygun kullanma taktikleri ve sır gibi saklanan çok özel dijital manipülasyon tekniklerine yer verilmiştir. Sık kullanılan ve sadece uzmanlar tarafından bilinen tekniklere yer verilen kitap, dünya çapında Youtube ve dijital manipülasyon teknikleri hakkında geniş bir içeriğe yer veren ve nasıl yapıldığını anlatan ilk eser olma özelliğini taşıyor. Üstelik herkes bu kitabı rahatça anlayıp, ele alınan teknikleri uygulayabilir: Tüm teknikler ilk defa bilgisayar kullanan bir insanın bile kolayca yapabileceği şekilde izah edilmiş...Bu eser, hızla gelişen ve sınırı olmayan dijital dünyada tüm hayallerinizi gerçekleştirebilecek imkânları sunuyor.<br><br>-Başarılı Bir Kanal Oluşturmak ve Büyütmek -Abone ve Hayran Kazanmak -Yüksek Görüntülenme Sayısı için Püf Noktalar -YouTube ve Adsense  -YouTube Ortaklık Ağları -Oyun Kanalı Açmak -Let's Playciler için Altın Rehber -Oyun Kanalınızı Büyütmek -Video Hazırlama Teknikleri -Videolarınız için Ücretsiz Stok Video ve Müzikler -Özgün Videolar için İpuçları -Youtube ve SEO -Backlink Nedir, Ne işe Yarar? -Gizli Silahlar -Yeni Nesil Backlink Yöntemleri ve Kaynakları -YouTube Reklam Modelleri -Kazanç Elde Etme Yöntemleri -Niş Çalışmaları -Yüksek Kazançlı Nişler -Sosyal Medya ve Dijital Pazarlama -Twitter, Pinterest, Linkedin, Instagram ile Pazarlama -Dönüşüm Oranını Arttırma -Video ile Pazarlama Stratejileri -Hızlı Abone Kazanma -YouTube'dan Dünyaya Canlı Yayın -Vlogger -Ücretsiz VPS<br><br>Abdullah Talha Karaalioğlu, 1986'da İstanbul'da dünyaya geldi. Yurt dışında yüksek lisans eğitimini tamamladıktan sonra gerçekleştirmek istediği projeler için Türkiye'ye döndü. Bir çok markanın proje yönetimini, business development ve dijital strateji danışmanlığını üstlendi. Avrupa'dan Türkiye'ye uyarlanan bir çok projede görev aldı.<br>(Tanıtım Bülteninden)<br><br><br><br><b>Sayfa Sayısı: </b>444<br><br><b>Baskı Yılı: </b>2016<br><br><br><b>Dili: </b>Türkçe<br><b>Yayınevi: </b>Pusula Yayıncılık</p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n               <strong>\n                   beklediğimden de iyi \n               </strong>\n               <p>Kitap elime bugün ulaştı ve paketi açınca şaşırdım enine boyuna büyük bir kitap içindekiler kısmını okuyunca buradaki yazan bilgilerden daha fazla bilgiye sahip kitap mutlaka almanızı öneriyorum başka kitaba gerek yok</p>\n           </div>", "detail": "<div class=\"comment-details\">\n               <p>20.12.2016</p>\n           </div>"}]},
{"product_name": "OpenCv", "author": "Birol Kuyumcu", "publisher": "Level", "content": "<p><br>Yazılım sektörünün gelişkinliği şüphesiz ki yapay zekâ alanındaki ilerlemelerle ölçülüyor. Akıllı cihazlar tamamen otomatik ya da daha az insan denetimi gerektiren makineler içeriklerinde yapay zekâ algoritmaları da barındıran yazılımlardır. Türkiye şartlarında çalışma alanınız değişmese bile daha zeki web sayfaları, daha akıllı veritabanları ya da mobil uygulamalar sizlerin çalışmalarınızı daha kıymetli yapacağı aşikârdır.<br><br>Yapay Zekâ uygulamalarının en büyük alanlarından biri de -Bilgisayarlı Görü- Computer Vision'dur. Temelde Görüntü İşleme metotları, ilaveten Yapay Öğrenme - Machine Learning algoritmaları içeren bir alandır. Bu alanda ülkemizde akademik olarak pek çok çalışma yapıldığı halde maalesef ticari çalışmaya pek rastlanamamaktadır. Biz de bu kitapla, bilgisayarlı görü alanında dünyaca en yaygın olarak kullanılan kütüphane olan OpenCv'yi sizlere tanıtmak; vereceğimiz örneklerle çalışmalar yaparak ufkunuzu bir nebze olsun açmayı umuyoruz.<br><br>C++ dili ile birlikte yer yer Qt Framework kullanarak, OpenCv'yi anlatan bu kitapta, aşağıda konu başlıklarına yer verilmiştir.<br>(Tanıtım Bülteninden)<br><br><br><br><b>Sayfa Sayısı: </b>320<br><br><b>Baskı Yılı: </b>2016<br><br><br><b>Dili: </b>Türkçe<br><b>Yayınevi: </b>Level</p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n                <p>Henüz yorum yapılmadı!</p>\n            </div>", "detail": null}]},
{"product_name": "İleri Düzey Excel 2016", "author": "Ömer Bağcı", "publisher": "Seçkin Yayıncılık", "content": "<p><br>Excel programını kullanıyor ve Excel'in gelişmiş özelliklerini kullanarak, Etkin bir Excel kullanım becerisine sahip olmak istiyorsanız Yeni sürüme göre güncellenmiş 7. baskısını yapan bu kitap tam size göre.<br><br>İleri Düzey Excel ve Dashboard Rapor oluşturma eğitimlerinde anlatılan konuları kapsayan ve günlük hayatta kullanabileceğiniz pek bilinmeyen Excel kısa yollarını anlatan bu kitap sayesinde, kursa gitmeye gerek kalmadan Excel bilginizi ileri düzeye taşır, Raporlarınızı kendiniz oluşturabilir ve Excel konusunda uzman olursunuz.<br><br>Türkiye'nin En geniş ve güncel Online Excel eğitim sitesi olan vidoport.com'dan Ücretsiz üyelik hakkı da kazandıran bu kitap ile Excel'de Koşullu Biçimlendirmelerden, veri doğrulama kullanımına, Özet tablolardan Makrolar kullanımına, EĞER İşlevini kullanımından, ÇOKETOPLA gibi işlevlerin kullanımına kadar işlevleri ve işlevlerin ortak kullanımlarını ve Dashboard Rapor oluşturma yöntemlerini rahatlıkla öğrenebilirsiniz. <br><br>Konularına göre dağıtılmış ve toplu olarakda bulunan ipuçları ile Excel'de bilmediğiniz konulardaki Kısa yolları öğrenebilir ve bunların eğitimlerini online olarak izleyebilirsiniz.<br><br>Adları Kullanmak<br>Koşullu Biçimlendirmeler Yapmak<br>Özet Tabloları Kullanmak<br>Hedef Ara ve Senaryoları Kullanmak<br>Alt Toplamlar Almak<br>Grafikler İle Çalışmak<br>3B Haritalar Oluşturmak<br>İşlevleri Kullanmak<br>İşlevlerin Ortak Kullanımları<br>Makroları Kullanmak<br>Excel Çözücüyü Kullanmak<br>Klavye Kısayolları<br>İleri Düzey Uygulamalar<br>Fonksiyonların İngilizce- Türkçe Karşılaştırmaları<br>Dashboard Raporlar Oluşturma<br>(Tanıtım Bülteninden)<br><br><br><br><b>Sayfa Sayısı: </b>495<br><br><b>Baskı Yılı: </b>2016<br><br><br><b>Dili: </b>Türkçe<br><b>Yayınevi: </b>Seçkin Yayıncılık</p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n                <p>Henüz yorum yapılmadı!</p>\n            </div>", "detail": null}]},
{"product_name": "Matlab Eğitim Seti", "author": "Cemalettin Kubat", "publisher": "Abaküs Kitap", "content": "<p><br>Matlab, Matrix Laboratory (matris laboratuvarı) kelimelerinin ilk üç harfi alınarak oluşturulmuş bir kelimedir. Matlab teknik bir programlama dilidir. İlk sürümünden bu zamana kadar geçirdiği aşamalara bakıldığında, bu dile yatırım yapanları pişman etmeyecek bir performansa sahip olduğu rahatlıkla söylenebilir. Matlab'ın arka planında çok ciddi akademik çalışma bulunmaktadır. Bu tür programlama dilini ve imkânlarını ülkemizin akademik ve endüstri dünyasına tanıtmak bizler için bir zorunluluktu. Matlab; kontrol, görüntü işleme, istatistik, optimizasyon, bulanık kontrol, sinir ağları, sayısal işaret işleme, güç sistemleri, filtre dizaynı, genetik algoritma, grafik, veri tabanı, web sunucusu, finans vb. gibi saymakla bitiremediğimiz bir çok alanda güvenli bir şekilde kullanılabilecek araç kutuları (toolbox) içerir.<br><br>Kitap hazırlanırken şu amaçlandı; Matlab'ın bilgisayarlarda kullanımından başlayarak temel özelliklerini ve imkânlarını tanıtmak suretiyle öğrenci, araştırmacı ve akademisyenlerin matematik kullanma ihtiyacını gidermeli, her seviyede karşılaşılacak problemin çözümünde rahatlık sağlamalı, fazla ayrıntıya girmeden kullanışlı olmalı, kolayca anlaşılabilen, karmaşık problemlerin çözümünü kolaylaştırıcı tarz ve özelliğe sahip, her seviyeden öğrenen ve öğretenlerin bu konuda el altı kitabı olmalı idi. Bu amaçlar göz önüne alınarak yazılan kitap Fen Bilimleri (Matematik, Fizik, Kimya), Teknik Bilimler (Mühendislik ve Teknik Eğitim) ve Sosyal Bilimler (İktisat, İşletme…) vb. alanlardaki öğrencilerin, araştırmacıların ve eğiticilerin ihtiyaç duyduğu analitik ve sayısal yöntemlerin kolayca kullanımını sağlama düşüncesi önde tutularak hazırlanmıştır.<br><br>Kitaba çok çeşitli alanlarda kullanılan matematik yöntemle ilgili Matlab komutlarının yanında, kullanıcının Matlab'ı bilgisayarına nasıl yükleyeceği ekran görüntüleriyle verilmiş, devamında bir problemin matematik çözümüne nasıl sistematik yaklaşılacağı belirtilmiş, daha sonraki bölümlerde ise gerekli komutlar sırasıyla verilmiştir. Burada Matlab komutları tanıtılırken halen okutulmakta olan çeşitli kaynaklardan, özellikle gerçek dünya problemlerini tanıtan örnekler seçilmeye çalışılmış, böylece öğrenci ve araştırmacıların öğrenmelerinin teşvik edilmesi ve çekiciliğin sağlanması amaçlanmıştır. Kitabın 20. Bölümüne çeşitli konularda çalışan çok sayıdaki araştırmacı ve öğrencinin çalışmasına yol gösterici olması amacıyla optimizasyon ve programlama ile çözülmüş çeşitli örnek problemler sunulmuştur. Son 3 bölümde ise öğrenci ve araştırmacılar tarafından son zamanlarda giderek ilgi duyulan yapay zekâ tekniklerinden en çok kullanım alanı bulan ve Matlab'da yer alan araç kutuları (toolbox) Bulanık Mantık(Fuzzy Logic), Yapay Sinir Ağları (Neural Network) ve Genetik Algoritmalar(Genetic Algorithms) tanıtılmış, bu üç tekniğin anlaşılması ve uygulanmasını kolaylaştıran örneklere yer verilmiştir.<br><br>Kitabın sonunda her bir komutun özellikle tanıtıldığı ve ilgi çekici örneklerin bulunduğu bölümlerdeki sahife numaralarını belirten Komutlar İndeksi verilerek de başka bir kolaylık sağlanmıştır. Kitabın çeşitli derslerle ilgili matematik yöntemlerin bilgisayar yardımıyla uygulanmasını kolaylaştırıcı yönüyle önemli bir boşluğu dolduracağı, ön lisans, lisans, yüksek lisans ve doktora seviyesindeki değişik alanlarda yer alan öğrenci, araştırmacı ve eğiticilerin ihtiyacına cevap vereceğini umuyoruz.<br><br>Kitap İçeriği<br></p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n                <p>Henüz yorum yapılmadı!</p>\n            </div>", "detail": null}]},
{"product_name": "Bilgisayar Ağlarında Saldırı ve Savunma", "author": "Gökhan Usta", "publisher": "Seçkin Yayıncılık", "content": "<p><br>Mesleğe gereği, çok sayıda network (ağ) sistemi kurulumu yapan ve bu networklerin güvenliği konusunda uzmanlaşmış olan yazar, edindiği bilgi ve tecrübeleri bu kitaba aktarmıştır. Günümüzde kötü amaçlı yazılımlar ve çeşitli saldırı yöntemleri sistem güvenliğini tehdit etmektedir. Kurumlarda bilgi sızmasına ve kaybına neden olan asıl önemli saldırılar kurum içerisinden gerçekleştirilmektedir. Bu kitapta bankalar, mağazalar, kamu kurumları, şirketler gibi kapalı iç ağa sahip ağların kendisine ve diğer kullanıcı bilgisayarlarına yapılabilecek saldırılar ve bu saldırılara karşı alınabilecek önlemler kapsamlı, karşılaştırmalı ve pratik olarak ele alınmıştır.<br><br>Güvenliği sağlamanın yolu, saldırıların nasıl gerçekleştirildiğini bilmekten geçmektedir. Bilgisayar ağlarında cihaz veya network protokollerinin çalışma prensiplerinden ortaya çıkan açıklıklar ve bu açıklıklara yönelik alınabilecek tedbirler (switch konfigürasyonu, sistem kurumu veya politika olarak) kitapta detaylı olarak verilmektedir. Ayrıca bu açıklıkları kullanan yazılım araçları ile bir saldırının nasıl gerçekleştirildiğini kitabın ekinde ücretsiz olarak verilen DVD'deki videolardan izleyebilir; DVD ile sunulan Kali Linux,  Virtual Box, GNS3 gibi yazılımlardan faydalanarak kendi ağınızı oluşturarak test ve denemelerinizi sanal ortamda kendiniz yapabilirsiniz.<br><br>Kitapta Bulunan Konu Başlıkları;<br><br>-Bilgisayar Ağlarında Güvenlik Kavramı<br>-Bilinmesi Gereken Temel Network Bilgileri<br>-Ethernet Anahtar Cihazının Mac Tablosuna Yapılan Saldırılar<br>-Arp Protokolünün Zayıflıkları Kullanılarak Yapılan Saldırılar<br>-DHCP Sunucuya Ve DHCP Protokolüne Yapılan Saldırılar<br>-802.1 Q Protokolüne Yapılan Saldırılar<br>-Spanning Tree Protokolüne Yapılan Saldırılar<br>-Sanal Yönlendirici Yedeklilik (VRRP) Protokolüne Yapılan Saldırılar<br>-Ethernet Üzerinden Güç Aktarma Protokolüne Yapılan Saldırılar<br>-Ethernet Anahtar Cihazın Kendisine Yapılan Servisin Durdurulması Saldırıları<br>-Diğer Saldırı Tipleri<br>-SDN (Software Defined Networks) ve Open Flow<br> (Tanıtım Bülteninden)<br><br><br><br><b>Sayfa Sayısı: </b>142<br><br><b>Baskı Yılı: </b>2015<br><br><br><b>Dili: </b>Türkçe<br><b>Yayınevi: </b>Seçkin Yayıncılık</p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n                <p>Henüz yorum yapılmadı!</p>\n            </div>", "detail": null}]},
{"product_name": "Aldatma Sanatı", "author": "Kevin D. Mitnick", "publisher": "Odtü", "content": "<p><br>Antivirüs yazılımları, yazılım ve donanım temelli güvenlik sistemleri, kameralar, manyetik kartlar, güvenlik görevlileri vs... bunların hiçbiri, devletlerin, şirketlerin ve şahısların bilgi güvenliğini garanti edemiyor.<br><br>Bilgisayar korsanlığı (hacker'lık) suçundan hapse giren, dünyanın ilk dijital suçlusu Kevin Mitnick, bilgi güvenliği konusuna artık diğer cepheden bakıyor: Dünyanın en pahalı güvenlik sistemlerinin birkaç basit telefon konuşmasıyla ve bilgisayar klavyesine bile el sürmeden nasıl alt edilebileceğini gösteren Mitnick, bilgi güvenliği sürecinin iyileştirilmesi için alınması gereken önlemleri sıralıyor. Bunlar, bir sihirbazın göz yanılsaması oyunları değil, tescilli bir toplum mühendisinin tecrübelere dayanan tavsiyeleridir.<br><br>Şirketinizin yeni geliştirdiği ürünler hakkındaki bilgileri, rakiplerinizin, sizin ruhunuz bile duymadan ele geçirmelerini istemiyorsanız; ya da milyonlarca müşterinin kimlik ve hesap bilgilerini tutan bir finans kuruluşunda çalışıyorsanız, toplum mühendisliğinin ne olduğunu ve nasıl zararlar verebileceğini öğrenmek için bu kitabı mutlaka okumalısınız.<br><br>Elektronik posta kullanıyorsanız, internete giriyorsanız, herhangi bir şekilde bilgisayar ağları üzerinde kişisel bilgilerinizi tutuyorsanız ve bilgisayar aracılığıyla alışveriş ya da bankacılık işlemleri yapıyorsanız bu kitabı mutlaka okumalısınız.<br><br>Aldanmamak için aldatma sanatının inceliklerini öğrenmelisiniz.<br><br><br><br><b>Sayfa Sayısı: </b>336<br><br><b>Baskı Yılı: </b>2016<br><br><br><b>Dili: </b>Türkçe<br><b>Yayınevi: </b>Odtü</p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n               <strong>\n                   Yorum\n               </strong>\n               <p>Açıkçası çok büyük hevesle sipariş ettiğim bu kitabı beğenmedim. İnsanların bazen çok dalgın olabileceği dışında bilgi vermiyor. Yazarın kendini beğenmiş, herkesi küçük gören bir anlatımı var. Tavsiye etmiyorum.</p>\n           </div>", "detail": "<div class=\"comment-details\">\n               <p>30.12.2013</p>\n           </div>"}]},
{"product_name": "Python", "author": "Mustafa Başer", "publisher": "Dikeyeksen", "content": "<p><br>Python, ilk sürümünden (1990 yılının başında) bu yana dikkatleri üzerine çeken genel amaçlı, yorumlamalı, nesne tabanlı, temiz kod yazılabilen, hızlı öğrenilebilen, hızlı uygulama geliştirilebilen ve birçok aracı (kütüphaneyi) içeren bir programlama dilidir. Bu kitap, programcılığa yeni başlayanlar için bir rehber, Python'u bilenler için bir başvuru kaynağı niteliğindedir. <br><br>Python konusunda uzun yıllar yayın üreten, kitaplar yazan ve akademik hayatına bu yönde devam eden Doç. Dr. Mustafa Başer'in 15 yıldan fazla deneyim ve tecrübesine dayanan kitabın başlıca konular şöyle:<br><br></p>", "comments": [{"content": null, "detail": null}, {"content": "<div class=\"comment-content\">\n                <p>Henüz yorum yapılmadı!</p>\n            </div>", "detail": null}]}
]